// ========== МАССИВ ВОПРОСОВ ==========
var myQuestions = [
    {
      text: "Для включения отборов в списках (управляемых форм) по содержимому табличных частей объектов и их свойств, неотображаемых в форме:",
      options: [

        "осуществляется только с помощью дополнительной настройки форм",
        "необходимо создать объект критерии отбора",
        "ничего дополнительно настраивать не надо, все реализовано на уровне платформы",
        "реализуется произвольным запросом динамического списка"
      ],
      correct: 2
    },
    {
    "text": "В какое значение можно установить свойство \"Серии кодов\" объекта конфигурации \"Справочник\"?",
    "options": [
      "Во всем справочнике",
      "В пределах подчинения",
      "В пределах подчинения владельцу",

      "Варианты 1 и 2",
      "Верны все указанные ответы"
    ],
    "correct": 4
  },
  {
    "text": "В каком объекте производится редактирование информации пользователем (например экземпляра документа)?",
    "options": [
      "Объект конфигурации",
      "Объект встроенного языка",
      "Объект информационной базы",
      "Форма объекта",
      "Форма списка",

      "Варианты 4 или 5"
    ],
    "correct": 3
  },
  {
    "text": "В механизме полнотекстового поиска для поиска с учетом синонимов слова \"алый\" используется выражение:",
    "options": [
      "!алый",
      "алый'",
      "(алый)",

      "\"алый\""
    ],
    "correct": 0
  },
  {
    "text": "Внешние обработки используются:",

    "options": [
      "На стадии отладки, для более быстрого внесения изменений в обработку",
      "Для разграничения прав доступа к обработке",
      "Для возможности редактирования/изменения функциональности обработки пользователем в режиме 1С:Предприятие",
      "Для реализации функциональности, не поставляемой с основной конфигурацией",
      "Варианты 1 и/или 3",
      "Варианты 1 и/или 4"

    ],
    "correct": 5
  },
  {
    "text": "Выберите верный набор ассоциаций \"Сущность системы\" - \"тип файла\":",
    "options": [

      "внешняя обработка -\"epf\", внешний отчет -- \"erf\", конфигурация -- \"сf\"",
      "внешняя обработка -\"ert\", внешний отчет -- \"mxl\", конфигурация -- \"pfl\"",
      "внешняя обработка -\"ert\", внешний отчет -- \" erf\", конфигурация -- \"cfu\"",
      "внешняя обработка -\"epf\", внешний отчет -- \"mxl\", конфигурация -- \"cfu\"",
      "внешняя обработка -\"epf\", внешний отчет -- \"erf\", конфигурация -- \"1CD\""

    ],
    "correct": 0
  },
  {
    "text": "Внешняя обработка может быть включена в состав конфигурации:",

    "options": [
      "Как отчет",
      "Как обработка",
      "Варианты 1 и 2",
      "Варианты 1 и 2 (но возможна потеря функциональности)"

    ],
    "correct": 2
  },
  {

    "text": "Внешний отчет может быть включен в состав конфигурации:",
    "options": [
      "Как отчет",
      "Как обработка",

      "Варианты 1 и 2",
      "Варианты 1 и 2 (но возможна потеря функциональности)"
    ],
    "correct": 3

  },
  {
    "text": "Где определяется структура, прикладная логика, создаваемого бизнес-приложения в системе 1С:Предприятие 8?",
    "options": [

      "Конфигурация",
      "Информационная база",
      "СУБД",
      "Варианты 2 или 3 (в зависимости от варианта использования системы)"

    ],
    "correct": 0
  },

  {
    "text": "Где хранятся учетные данные бизнес-приложения в системе 1С:Предприятие 8?",
    "options": [
      "Технологическая платформа",

      "Конфигурация",
      "Информационная база"
    ],

    "correct": 2
  },
  {
    "text": "Для включения отборов в списках (обычных форм) по содержимому табличных частей объектов и их свойств, неотображаемых в форме:",

    "options": [
      "ничего дополнительно настраивать не надо, все реализовано на уровне платформы",

      "реализуется только запросами",
      "осуществляется только с помощью дополнительной настройки форм",
      "необходимо создать объект критерии отбора"

    ],
    "correct": 3
  },

{
  "text": "Для установки языка интерфейса прикладного решения пользователю, необходимо:",
  "options": [
    "в настройках пользователя выбрать возможный язык, из списка дополнительных интерфейсов",

    "в настройках пользователя выбрать возможный язык, из списка языков интерфейсов, заданных в ветви метаданных \"Языки\"",
    "в настройках пользователя выбрать возможный язык, из списка предопределенных в платформе языков",
    "верны варианты 1 и 2",

    "верны все варианты"

  ],

  "correct": 1

},

{

  "text": "Для запрета режима непосредственного удаления объектов пользователем необходимо...",

  "options": [

    "в свойствах конфигурации снять флаг \"Разрешить непосредственное удаление объектов\"",

    "при определении роли для соответствующих объектов снять отметку у флага \"Удаление\"",

    "при определении роли для соответствующих объектов снять отметку у флага \"Интерактивное удаление\"",

    "в свойствах роли снять отметку у флага \"Разрешить удаление объектов\"",

    "в свойствах роли снять отметку у флага \"Разрешить интерактивное удаление объектов\""

  ],

  "correct": 2

},

{

  "text": "Для каких компонент существуют сетевые ключи защиты?",

  "options": [
    "Клиентское приложение",
    "Мобильный клиент",

    "Сервер 1С:Предприятия",
    "Правильны ответы 1 и 3",
    "Правильны ответы 1 и 2",
    "Верны все варианты"
  ],
  "correct": 4

},
{
  "text": "Для каких объектов конфигурации возможен ввод предопределенных значений?",
  "options": [

    "Справочники",

    "Документы",
    "Планы видов характеристик, планы счетов, планы видов расчета",
    "Справочники, планы видов характеристик",
    "Справочники, планы видов характеристик, планы счетов, планы видов расчета",

    "Все вышеперечисленные"

  ],

  "correct": 4

},

{

  "text": "Для каких целей может использоваться \"Толстый клиент\"?",

  "options": [

    "Использование прикладного решения",
    "Отладка прикладного решения",

    "Разработка прикладного решения",
    "Верны варианты 1 и 2",

    "Верны все варианты"
  ],

  "correct": 4

},
{

  "text": "Для каких целей может использоваться \"Тонкий клиент\"?",

  "options": [
    "Использование прикладного решения",
    "Отладка прикладного решения",
    "Разработка прикладного решения",

    "Верны варианты 1 и 2",
    "Верны все варианты"
  ],
  "correct": 3

},
{
  "text": "Для каких целей служат табличные части справочников?",

  "options": [
    "Для хранения подчиненных сущностей, имеющих объектную природу",
    "Для хранения подчиненных сущностей, не имеющих объектной природы",

    "Для формирования печатных форм элементов справочника",
    "У справочников не может быть табличных частей"
  ],

  "correct": 1
},

{
  "text": "Для нечеткого поиска данных (с одной ошибкой) в механизме полнотекстового поиска используется выражение:",
  "options": [

    "!манолит",
    "~манолит",

    "манолит*",
    "\"манолит\""
  ],

  "correct": 1
},

{
  "text": "Для объектов конфигурации \"Бизнес-процесс\" и \"Задача\" выберите верное утверждение:",

  "options": [

    "В конфигурации может быть только один Бизнес-процесс и одна Задача",
    "Бизнес-процесс может связываться одновременно с несколькими Задачами",

    "Каждая Задача может использоваться в нескольких Бизнес-процессах",

    "Варианты 2 и 3",

    "При конфигурировании нет возможности определить связь между Бизнес-процессами и Задачами (она реализуется программно)"

  ],

  "correct": 2

},
{

  "text": "Если рабочие серверы кластера 1С:Предприятие работают с использованием разных операционных систем то:",
  "options": [
    "ни каких ограничений на используемые СУБД нет",
    "с MS SQL сервер можно работать с рабочего сервера под управлением операционных систем Windows, c другими СУБД только из-под Linux",

    "с MS SQL сервер можно работать с рабочего сервера под управлением операционных систем Windows, c другими СУБД как из-под Windows, так и из-под Linux"
  ],
  "correct": 2
},
{

  "text": "Из чего состоит основная конфигурация?",
  "options": [
    "Объекты конфигурации",
    "Объекты встроенного языка",
    "Объекты информационной базы",
    "Верны ответы 1 и 3",
    "Верны все варианты"
  ],

  "correct": 0
},
{
  "text": "Как можно разделить список пользователей на группы?",
  "options": [

    "Нет такой возможности, список един для базы данных",
    "В списке пользователей можно создать группу пользователей",
    "Разделение списка осуществляется с помощью общих реквизитов"
  ],
  "correct": 2
},
{

  "text": "Как разделить механизм нумерации документов по филиалам для многофирменного учета?",
  "options": [
    "Используя механизм префиксации (программно)",
    "С помощью механизма разделения данных",

    "Варианты 1 и/или 2",
    "Разделение нумератора для многофирменного учета не поддерживается"
  ],
  "correct": 2
},
{

  "text": "Какие варианты подчинения существуют в системе 1С:Предприятие 8?",
  "options": [
    "группам",

    "элементам",
    "группам и элементам",
    "Варианты 1 и 3",

    "Варианты 2 и 3",
    "Верны все указанные ответы"
  ],

  "correct": 5
},
{

  "text": "Пользователь может создать в справочнике группу",

  "options": [

    "Если в настройках справочника вид иерархии установлен в \"Иерархия элементов\"",

    "Если в настройках справочника вид иерархии установлен в \"Иерархия групп и элементов\"",

    "Если количество уровней иерархии более 2х (вне зависимости от вида иерархии)",

    "В любом случае, вне зависимости от настройки объекта конфигурации",
    "Варианты 1 и 3",
    "Варианты 2 и 3"
  ],

  "correct": 1
},
{
  "text": "Какие компоненты типовой поставки в системе 1С:Предприятие 8 защищены аппаратным ключом?",
  "options": [
    "Клиентское приложение",

    "Типовое решение фирмы 1С",
    "Сервер 1С:Предприятия",
    "Варианты 1 и 3",
    "Варианты1 и 2",
    "Верны все варианты"
  ],
  "correct": 3
},
{

  "text": "Какие объекты используются при описании алгоритма?",
  "options": [
    "Объекты конфигурации",

    "Объекты встроенного языка",
    "Объекты информационной базы",
    "Варианты 1 и 3",
    "Верны все варианты"

  ],
  "correct": 1
},
{
  "text": "Какими данными и с какой целью обеспечивает пользователя \"Граница последовательности документов\"?",
  "options": [
    "Моментом времени, начиная с которого перепроведение документов последовательности в хронологическом порядке, восстановит правильность (актуальность) учета, контролируемого последовательностью",

    "Датой, начиная с которой перепроведение всех документов в хронологическом порядке, восстановит правильность (актуальность) учета, контролируемого последовательностью",
    "Ссылкой на документ последовательности, начиная с которого перепроведение документов последовательности в хронологическом порядке, восстановит правильность (актуальность) учета, контролируемого последовательностью"
  ],
  "correct": 0
},

{
  "text": "Каким может быть тип данных ресурса у регистра сведений?",
  "options": [
    "Один из примитивных типов данных",
    "Ссылочные типы данных",
    "Хранилище значений",
    "Составной тип данных",
    "Верны все перечисленные ответы",

    "Верны ответы 1 и 2"
  ],
  "correct": 4
},
{
  "text": "Какого вида клиентского приложения не существует в системе 1С:Предприятие 8?",
  "options": [
    "Мобильный клиент",
    "Толстый клиент",

    "Тонкий клиент",
    "Веб -- клиент",
    "Варианты 2 и 3",
    "Существуют все перечисленные виды клиентских приложений"
  ],

  "correct": 5
},
{
  "text": "Какое максимальное количество видов документов позволяет создать система 1С:Предприятие 8 в процессе конфигурирования?",
  "options": [
    "Неограниченное",

    "Ограничивается свойством конфигурации \"Количество видов документов\", по умолчанию значение равно 50, можно увеличить до 150",
    "256, т.к. система не позволяет обрабатывать более 256 таблиц объектов",
    "50, считается, что при большем количестве видов документов их можно объединять используя понятие \"Операция документа\""
  ],
  "correct": 0

},
{
  "text": "Какое максимальное количество реквизитов документа позволяет определить система 1С:Предприятие 8?",
  "options": [
    "Количество реквизитов документа не ограничено",
    "Максимальное количество реквизитов ограничивается в свойстве \"Количество реквизитов\"",

    "Количество реквизитов документа не ограничено, но при этом реквизитов ссылочного типа не может быть больше 10",
    "Количество реквизитов зависит от варианта работы с информационной базой. В файловом - до 50 реквизитов, в клиент-серверном - неограниченно"
  ],
  "correct": 0
},

{
  "text": "Какое максимальное количество табличных частей документа позволяет определить система 1С:Предприятие 8?",
  "options": [
    "Количество табличных частей документа не ограничено",

    "Максимальное количество табличных частей ограничивается в свойстве \"Количество табличных частей\"",
    "У документа может быть только одна табличная часть",
    "Количество табличных частей зависит от варианта работы с информационной базой. В файловом - до 50, в клиент-серверном - неограниченно"
  ],

  "correct": 0
},
{
  "text": "Какую конфигурацию можно изменять интерактивно в конфигураторе?",
  "options": [

    "Основная конфигурация",
    "Конфигурация базы данных",
    "Конфигурация поставщика",

    "Варианты 1 или 2",

    "Варианты 1 или 2 или 3"
  ],
  "correct": 0
},

{
  "text": "Картинки для прикладного решения могут браться из ...",
  "options": [
    "библиотеки картинок технологической платформы",
    "библиотеки картинок конфигурации",

    "из файловой системы",
    "Варианты 1 и 2",
    "Верны все варианты"
  ],

  "correct": 4
},
{
  "text": "Можно ли в системе 1С:Предприятии определить свой тип данных, например \"ЦенаНоменклатуры\"?",
  "options": [

    "Да, для этого есть определяемые типы",
    "Да, для этого есть общие реквизиты",
    "Такой возможности в платформе нет",
    "Свой тип можно создать только в расширении конфигурации (с любым назначением)",
    "Свой тип можно создать только в расширении конфигурации с назначением: \"Дополнение\""
  ],
  "correct": 0
},
{
  "text": "На компьютерах с какой операционной системой могут работать пользователи системы 1С:Предприятия 8.3?",
  "options": [
    "Windows",
    "Linux",
    "Mac OS X",
    "Варианты 1 и 2",

    "Варианты 1 и 2 и 3"
  ],
  "correct": 4
},
{
  "text": "Назовите основное назначение объекта \"Последовательность документов\"?",
  "options": [
    "Автоматизация контроля над хронологическим порядком проведения документов тех видов, которые указаны в последовательности",
    "Чтобы запрещать пользователю непоследовательное проведение документов",
    "Чтобы запрещать пользователю проведение документов \"задним числом\"",
    "Автоматизация разрешения коллизий при одновременной записи в информационную базу нескольких документов, принадлежащих последовательности",
    "Этот объект позволяет вести список тех документов, которые были проведены \"задним числом\""
  ],
  "correct": 0

},
{
  "text": "Назовите основное назначение объектов типа \"Документ\"?",
  "options": [
    "Предназначены для хронологического отражения в системе событий предметной области, например, хозяйственных операций предприятия",
    "Предназначены для отражения в системе условно-постоянной информации, например, данных о контрагентах",
    "Предназначены только для отражения хозяйственных операций в регистрах учета, например, в регистрах бухгалтерии",
    "Предназначены только для печати на бумажных носителях унифицированных форм, например, счетов-фактур, расходных накладных (по данным содержащимся в документе)",
    "Предназначены только для хранения и последующей обработки больших объемов данных в целях получения информации нового качества, например, формирование книги покупок, книги продаж по учету НДС"
  ],
  "correct": 0
},

{
  "text": "Можно ли в 1С:Предприятии создать общий реквизит?",
  "options": [
    "Да, можно",
    "Механизмы для создания общих реквизитов в платформе отсутствуют",
    "Да, но только если включен режим разделения данных",
    "Да, но только если режим разделения данных отключен"
  ],
  "correct": 0
},
{
  "text": "Назовите основное назначение объектов типа \"ЖурналДокументов\"",
  "options": [
    "Журнал представляет собой отдельную таблицу, содержащую список документов определенных видов, собранных по принципу общности отражаемых событий предметной области и предоставляемых пользователю в едином, упорядоченном по хронологии списке",
    "Журнал представляет собой отдельную таблицу, содержащую список документов определенного вида, упорядоченный по хронологии. Каждый вид документа должен быть зарегистрирован в одном из журналов документов, иначе пользователь не сможет работать со списком документов этого вида",

    "Журнал документов представляет собой таблицу для хранения всех документов в едином списке, упорядоченном по хронологии. Отличие журналов друг от друга заключается в составе дополнительных граф",
    "Объект \"Журнал документов\" представляет собой представление списка документов определенного вида, под журнал документов таблица в базе данных не создается"
  ],
  "correct": 0
},
{
  "text": "Назовите основную функцию нумератора документов?",
  "options": [
    "Сквозная нумерация документов разного вида",
    "Для задания типа номера, периодичности нумерации документа",
    "Для реализации префиксации номеров документа",
    "Определяет тип номера, периодичность нумерации в документе если у него снят флажок в свойстве \"Автонумерация\""
  ],

  "correct": 0
},
{
  "text": "Объект конфигурации Константа...",
  "options": [
    "Предназначены для хранения постоянной информации (нет возможности изменить хранимое значение)",
    "Предназначены для хранения постоянной, условно-постоянной информации",
    "Предназначены для определения собственного типа значения",
    "Предназначены для определения фиксированного списка значений"
  ],
  "correct": 1
},
{
  "text": "Объект конфигурации Перечисление...",

  "options": [
    "прикладной объект, значения которого задаются в Конфигураторе.",
    "может хранить различные типы значений",
    "для него может быть заданы форма списка и выбора",
    "верны все указанные ответы",
    "верны ответы 1 и 3"
  ],
  "correct": 4
},
{
  "text": "Объект конфигурации Отчет...",
  "options": [

    "может быть сохранён во внешний файл как внешняя обработка",
    "может сравниваться с внешней обработкой, формируя отчет в печатной форме",
    "может быть добавлен в конфигурацию из внешней обработка",
    "верны все указанные ответы"
  ],
  "correct": 3
},
{
  "text": "Ограничен ли состав тех регистров учета, в которых документ может выступать в качестве регистратора движения?",
  "options": [

    "Да, ограничен специальным списком. Документ может выступать в качестве регистратора движения только у тех регистров, которые отмечены на закладке \"Движения\" окна редактирования объекта",
    "Да, ограничен. Документ может выступать в качестве регистратора движения только в одном регистре, который выбран на закладке движения окна редактирования объекта",
    "Да, ограничен типом регистра. Документ может выступать в качестве регистратора движения только в одном типе регистров (накопления или бухгалтерии или расчета)",
    "Нет, не ограничен. Документ может выступать в качестве регистратора движения в любых регистрах"
  ],
  "correct": 0

},

{
  "text": "Определите отличие между вводом документа копированием и вводом \"на основании\"",

  "options": [
    "Копирование -- создание нового объекта копированием существующего, причем того же типа и с идентичными данными, а ввод на основании обычно создает объект другого типа, данные которого лишь функционально зависят от \"объекта-основания\"",

    "Между этими операциями нет отличия",

    "При копировании документ создается и сразу записывается в информационную базу, а при вводе на основании пользователь может изменить перенесенные в новый созданный объект данные и только затем записать объект",
    "Варианты 1 и 3"
  ],
  "correct": 0
},
{

  "text": "Отчет и обработка...",
  "options": [
    "находятся в разных ветвях дерева конфигурации, имеют схожую структуру, предполагается, что отчет выводит данные, обработка - изменяет (хотя с помощью обработки можно выводить данные и наоборот)",
    "отчет предназначен исключительно для вывода учетной информации, обработка - для преобразования учетных данных",
    "находятся в разных ветвях дерева конфигурации, имеют разную структуру и назначение"
  ],
  "correct": 0
},
{
  "text": "Параметры сеанса инициируются:",

  "options": [
    "при запуске системы",
    "при первом программном обращении (в рамках сеанса)",

    "интерактивно при запуске системы",
    "Верны варианты 1 и 2",
    "Верны все варианты (в зависимости от настройки подключения к базе данных)"
  ],
  "correct": 3
},
{

  "text": "При каких условиях необходима установка свойства \"Оперативное проведение\" документа в значение \"Запретить\"?",
  "options": [
    "Когда документ ориентируется на проведение в реальном (настоящем) времени.",
    "Когда документ проводится только по регистрам бухгалтерии",
    "Когда документ ориентируется на проведение прошлым временем (\"задним числом\").",
    "Когда документ ориентируется на проведение будущим временем.",
    "Верны варианты 3 или 4",
    "Верны варианты 2 или 3 или 4"
  ],
  "correct": 3

},
{
  "text": "При каких условиях необходима установка свойства \"Оперативное проведение\" документа в значение \"Разрешить\"?",
  "options": [
    "Когда нужно различать факт проведения в реальном (сейчас) и прошлом времени (\"задним числом\")",
    "Когда документ должен проводиться только в реальном времени",
    "Когда документ ориентируется на проведение прошлым временем (\"задним числом\").",
    "Когда документ ориентируется на проведение будущим временем.",

    "Когда документ не проводится по регистрам бухгалтерии",
    "Варианты 1 или 2"
  ],
  "correct": 0
},
{
  "text": "При настройке ограничений прав доступа (в ролях), при определении шаблонов:",

  "options": [
    "в них можно определить один параметр, значение которого будет передаваться при указании шаблона в конкретном ограничении доступа к данным",
    "в них можно определить любое количество параметров, значение которых будет передаваться при указании шаблона в конкретном ограничении доступа к данным",
    "параметры в шаблонах использовать нельзя",

    "определение шаблонов и заключается в описании параметров"
  ],
  "correct": 1
},
{
  "text": "При настройке ограничения прав доступа на уровне записей и полей базы данных значения параметров для условий определяются...",

  "options": [
    "как переменные, определенные в модуле приложения",
    "как переменные, определенные в модуле приложения с ключевым словом Экспорт",
    "как параметры сеанса",
    "как константы",

    "как переменные определяемые в соответствующем обработчике события"
  ],
  "correct": 2
},
{

  "text": "При необходимости внести в механизм полнотекстового поиска свой дополнительный словарь (синонимы, специфичные для какого-либо рода деятельности) его можно включить в конфигурацию:",
  "options": [
    "как константу",

    "как общий макет",
    "как параметр сеанса",
    "верны ответы 1 и 2",
    "верны ответы 1 и 2 и 3"

  ],
  "correct": 3
},
{

  "text": "При создании нового документа и отказа от его записи номер документа:",
  "options": [
    "не может быть использован другим документом",
    "может быть использован другим документом",
    "может или не может быть использован повторно, зависит от значения соответствующего свойства конфигурации",
    "даже не назначался документу (назначение происходит при записи)"

  ],
  "correct": 2
},

{
  "text": "При создании нового Плана видов характеристик обязательно должны быть заполнены:",
  "options": [
    "Свойство \"Тип значения характеристик\"",
    "Свойство \"Дополнительные значения характеристик\"",
    "Оба свойства могут быть не заполнены",
    "Обязательно должны быть заполнены свойства \"Тип значения характеристик\" и \"Дополнительные значения характеристик\""
  ],
  "correct": 0
},
{

  "text": "Произвольная (к примеру по прикладным механизмам) классификация объектов конфигурации осуществляется с помощью:",
  "options": [
    "свойства \"Классификационная группа\" у объекта конфигурации",
    "с помощью объекта конфигурация Подсистемы",
    "заданием порядковых номеров объектов конфигурации по разным шаблонам",
    "Варианты 1 и 3",
    "Верны все варианты"
  ],
  "correct": 1
},
{

  "text": "Роль, как объект конфигурации, отражает:",
  "options": [
    "статус и сферу ответственности ее носителя как сотрудника компании",
    "совокупность доступных определенному пользователю объектов в среде \"1С:Предприятие\"",
    "совокупность прав действий в среде \"1С:Предприятие\" с возможностью присвоения конкретному пользователю",
    "набор параметров пользователя"
  ],
  "correct": 2
},
{
  "text": "С какими СУБД работает система 1С:Предприятие 8?",
  "options": [
    "Microsoft SQL Server",

    "Microsoft SQL Server, PostgreSQL",
    "Microsoft SQL Server, PostgreSQL, IBM DB2",
    "Microsoft SQL Server, PostgreSQL, IBM DB2, Oracle Database",
    "Microsoft SQL Server, PostgreSQL, IBM DB2, Oracle Database, файловая база данных",
    "Microsoft SQL Server, PostgreSQL, Oracle Database"
  ],

  "correct": 4
},
{

  "text": "С помощью какого свойства можно определить, какому документу принадлежит запись регистра?",
  "options": [
    "Регистратор",
    "Документ",
    "ТекущийДокумент",
    "Специального свойства у записи регистра нет. Для этих целей можно определить у регистра реквизит типа \"ДокументСсылка\""
  ],
  "correct": 0

},
{
  "text": "С помощью чего осуществляется разработка бизнес-приложений в системе 1С:Предприятие 8?",
  "options": [
    "Технологическая платформа",
    "Конфигурация",
    "Информационная база",
    "СУБД"

  ],
  "correct": 0
},
{
  "text": "При обращении к неинициализированному параметру сеанса:",
  "options": [
    "будет вызвано исключение",

    "будет выполнен обработчик \"Установка параметров сеанса\", и если значение не будет инициализировано, будет вызвано исключение",
    "будет выполнен обработчик \"Установка параметров сеанса\", и если значение не будет инициализировано, то оно будет установлено в \"Неопределено\"",
    "будет выполнен обработчик \"Установка параметров сеанса\", и если значение не будет инициализировано, то будет установлено значение по умолчанию для указанного в параметре сеанса типа значения",
    "такая ситуация не возможна, параметры сеанса не могут быть неинициализированными"
  ],

  "correct": 1
},
{
  "text": "Сколько информационных баз может быть с одной и той же конфигурацией?",
  "options": [
    "Только одна",

    "Только две (рабочая и демонстрационная)",
    "Неограниченно",
    "Определяется комплектом поставки прикладного решения",
    "Определяется в настройках конфигурации"
  ],
  "correct": 2

},
{
  "text": "Сколько конфигураций может существовать в прикладном решении?",
  "options": [
    "Одна",
    "Две",

    "Три",
    "Сколько угодно"
  ],
  "correct": 3
},

{
  "text": "У объекта \"Табличная часть\" в качестве подчиненных объектов могут быть...",
  "options": [
    "реквизиты",
    "табличные части",

    "формы табличных частей",

    "Варианты 1 и 2",
    "Верны все варианты"

  ],
  "correct": 0
},
{
  "text": "Хранение бинарных данных в конфигурации:",

  "options": [
    "невозможно",
    "реализовано с помощью макетов",
    "обеспечивается константами и реквизитами с типом данных \"Хранилище значений\"",
    "верны варианты 2 и 3"

  ],
  "correct": 1

},
{
  "text": "Что произойдет, если удалить предопределенный элемент в конфигураторе",
  "options": [

    "Будет выдано предупреждение об ошибке",
    "Элемент в режиме 1С:Предприятие будет удален",
    "Элемент в режиме 1С:Предприятие будет помечен на удаление",
    "Элемент в конфигураторе удалить нельзя, можно только убрать его из отображаемых значений"
  ],
  "correct": 2
},

{
  "text": "Что произойдет, если удалить предопределенный элемент в режиме 1С:Предприятие?",
  "options": [
    "Будет выдано предупреждение об ошибке",
    "Элемент будет удален и в конфигураторе и в 1С:Предприятие",
    "Элемент будет удален только в 1С:Предприятие"
  ],

  "correct": 2
},
{
  "text": "Что разрешено разработчикам прикладных решений в системе 1С:Предприятие 8?",
  "options": [
    "Изменять функциональность типовых тиражных решений",

    "Создавать собственные прикладные решения",
    "Изменять компоненты технологической платформы",
    "Правильны ответы 1 и 2",
    "Верны все варианты"
  ],
  "correct": 3

},
{
  "text": "Что содержится в объекте информационной базы при редактировании нового элемента справочника с табличными частями?",
  "options": [
    "Данные реквизитов",

    "Ссылка на элемент справочника",
    "Строки табличных частей",
    "Верны ответы 1 и 3",
    "Верны все варианты"
  ],

  "correct": 3
},
{
  "text": "Что содержится в объекте информационной базы при редактировании существующего в базе элемента справочника с табличными частями?",
  "options": [

    "Данные реквизитов",
    "Ссылку на элемента справочника",
    "Строки табличных частей",
    "Варианты 1 и 3",

    "Верны все варианты"
  ],
  "correct": 4
},
{

  "text": "Для запрета режима непосредственного удаления предопределенных элементов справочника пользователем необходимо...",
  "options": [
    "в свойствах конфигурации снять флаг \"Разрешить непосредственное удаление предопределенных\"",

    "при определении роли для соответствующих объектов снять отметку у флага \"Интерактивное удаление предопределенных\"",
    "при определении роли для соответствующих объектов снять отметку у флага \"Интерактивное удаление\"",
    "в свойствах роли снять отметку у флага \"Разрешить интерактивное удаление предопределенных\"",
    "в свойствах роли снять отметку у флага \"Разрешить интерактивное удаление объектов\"",

    "возможности удаления предопределенных элементов в системе нет"
  ],
  "correct": 1
},

{
  "text": "Какую конфигурацию можно изменять интерактивно в конфигураторе?",
  "options": [

    "Основная конфигурация",
    "Конфигурация расширения",
    "Конфигурация базы данных",
    "Варианты 1 или 2",

    "Варианты 1 или 2 или 3"
  ],
  "correct": 0

},
{
  "text": "При заведении значения объекта конфигурации \"Перечисление\":",

  "options": [
    "Указывается имя, синоним, комментарий",
    "Может определяется состав реквизитов",
    "Может определяется состав табличных частей",
    "Варианты 1 и 2",

    "Верны все варианты"
  ],
  "correct": 0
},
{
  "text": "Механизм \"История данных\" (версионирование) позволяет настраивать хранение истории данных до:",
  "options": [

    "объекта конфигурации",
    "табличной части",
    "реквизита",
    "Варианты 1 и 2",

    "Варианты 1 и 2 и 3"
  ],
  "correct": 4
},
{
  "text": "Для использования механизма \"История данных\" (версионирование) требуется:",

  "options": [
    "определенным образом настроить объект конфигурации и подчиненные ему объекты",
    "выполнить настройку средствами встроенного языка системы",
    "Варианты 1 и 2 (требуется и настройка объекта конфигурации и выполнение настройки из встроенного языка)",
    "Варианты 1 или 2"
  ],
  "correct": 3
},
{
  "text": "Какие виды программных модулей существуют в \"1С:Предприятие 8\"?",
  "options": [

    "Общие модули, модуль сеанса, модули форм",
    "Модуль обычного приложения, модуль управляемого приложения, общие модули, модуль сеанса, модули объектов, модули форм",
    "Модуль обычного приложения, модуль управляемого приложения, модуль внешнего соединения, модуль сеанса, общие модули и модули форм",
    "Модуль обычного приложения, модуль управляемого приложения, модуль внешнего соединения, модуль сеанса, общие модули, модули форм и модули макетов",
    "Модуль обычного приложения, модуль управляемого приложения, модуль внешнего соединения, модуль сеанса, модуль команды, общие модули, модули менеджера, модули форм, модули объектов и модули набора записей",
    "Модуль приложения, модуль внешнего соединения, модуль сеанса, общие модули, модули форм, модули макетов, модули объектов и модули набора записей"
  ],
  "correct": 4
},
{

  "text": "Какие разделы существуют в общем модуле?",
  "options": [
    "Раздел объявления переменных, раздел процедур и функций, раздел основной программы",
    "Только раздел процедур и функций",
    "Только раздел основной программы",
    "Только раздел объявления переменных и раздел описания процедур и функций"
  ],
  "correct": 1
},
{
  "text": "Модуль приложения рекомендуется использовать",

  "options": [
    "для определения предопределенных процедур \"ПриНачалеРаботыСистемы\" и т.п.",
    "как место определения процедур и функций, используемых во всей конфигурации",
    "как место определения предопределенных процедур, которые инициализируются при старте и окончании работы системы в режиме внешнего соединения",
    "верны ответы 1 и 2"
  ],
  "correct": 0
},
{
  "text": "В общих модулях",
  "options": [
    "нет ограничений на описание переменных, процедур, функций",
    "нельзя описывать переменные",

    "нельзя описывать переменные, процедуры и функции без ключевого слова \"Экспорт\"",
    "верны ответы 1 и 2"
  ],
  "correct": 1
},
{
  "text": "Типизация переменных во встроенном языке \"1С:Предприятие 8\"",
  "options": [
    "не жесткая, т.к. тип переменной определяется ее значением",
    "не жесткая, т.к. неявным определением переменной является ее первое упоминание в левой части оператора присваивания",
    "жесткая, т.к. обязательным является объявление переменной в явном виде",
    "жесткая, т.к. неявным определением переменной является ее первое упоминание в левой части оператора присваивания",

    "верны утверждения 1 и 2",
    "верны утверждения 3 и 4"
  ],
  "correct": 4
},
{
  "text": "В модуле приложения",
  "options": [
    "нет ограничений на описание переменных, процедур, функций",
    "нельзя описывать переменные",

    "нельзя описывать процедуры и функции без ключевого слова \"Экспорт\"",
    "нельзя описывать переменные без ключевого слова \"Экспорт\""
  ],
  "correct": 0
},
{
  "text": "Какой должен быть порядок определения процедур и функций в программном модуле?",
  "options": [

    "Описание функций должно идти выше описания процедур и раздела основной программы",
    "Описание вызываемых процедур и функций должно идти выше вызывающих",
    "Порядок следования процедур и функций не имеет значения",
    "Порядок следования процедур и функций зависит от типа модуля"
  ],
  "correct": 2
},

{
  "text": "Какое высказывание о модуле приложения верно?",
  "options": [
    "Модуль приложения используется для обработки событий, связанных с началом и завершением работы системы",
    "Модуль приложения используется для объявления глобальных клиентских переменных",
    "Модуль приложения используется для объявления глобальных процедур и функций, доступных в любых других модулях",
    "Верны все вышеперечисленные высказывания",

    "Верны ответы 1 и 2"
  ],
  "correct": 4
},
{
  "text": "Только определения процедур и функций может содержать следующий вид модуля:",
  "options": [
    "модуль приложения",

    "общий модуль",
    "модуль сеанса",
    "модуль объекта",
    "верны ответы 2, 3",
    "верны ответы 2, 4"

  ],
  "correct": 4
},
{
  "text": "Модуль сеанса (выберите наиболее полный правильный ответ):",
  "options": [
    "предназначен для инициализации параметров сеанса и отработки действий, связанных с сеансом работы",

    "не содержит экспортируемых процедур и функций",

    "исполняется в привилегированном режиме",
    "исполнение происходит после начала исполнения модуль приложения (модуля внешнего соединения)",

    "верны ответы 1 и 3",
    "верны ответы 1 и 2 и 3 и 4"
  ],
  "correct": 5
},

{
  "text": "Имя общего модуля может совпадать с именем свойства глобального контекста (например \"Отчеты\"):",

  "options": [
    "может в любом случае",
    "может, но только если модуль глобальный",

    "может, но только если модуль не глобальный"
  ],

  "correct": 1

},
{

  "text": "Какие функции отсутствуют во встроенном языке \"1С:Предприятие 8\":",
  "options": [

    "Функции работы со значениями типа Дата",

    "Функции работы со значениями типа Время",
    "Функции работы со значениями типа Строка",

    "Функции работы со значениями типа Число",

    "Все вышеперечисленные функции имеются во встроенном языке"

  ],

  "correct": 1
},

{

  "text": "Ключ может быть произвольного типа",

  "options": [
    "у структуры",
    "у соответствия",

    "у массива",
    "ни у одного из вышеперечисленных"
  ],

  "correct": 1
},

{
  "text": "Что произойдет, если удалить запись регистра сведений и создать новую с такими же полями (измерениями, ресурсами, реквизитами)?",
  "options": [
    "Ничего, на логику программы это никак не повлияет",

    "У этой записи будет другой внутренний идентификатор (ссылка) и это может повлиять на логику программы",
    "Возникнет исключительная ситуация"

  ],
  "correct": 0
},
{
  "text": "Как повлияет удаление элемента справочника, который уже используется в других объектах, а потом создать новый с такими же реквизитами, на поведение программы?",

  "options": [
    "Ничего, на логику программы это никак не повлияет",
    "У элемента будет другой внутренний идентификатор (ссылка) и это может повлиять на логику программы",
    "Возникнет исключительная ситуация"
  ],

  "correct": 1
},
{
  "text": "С помощью функциональности объекта какого типа можно перебирать данные справочника?",
  "options": [

    "СправочникиМенеджер",
    "СправочникМенеджер",
    "СправочникВыборка",
    "СправочникОбъект",

    "СправочникСписок"
  ],
  "correct": 2
},

{
  "text": "В каком свойстве хранится дата (со временем) документа?",
  "options": [
    "Дата",

    "ДатаДок",
    "ДатаДокумента",
    "ДатаВремя",
    "Отдельно Дата, отдельно Время",

    "Нет правильного ответа"
  ],
  "correct": 0

},
{
  "text": "Где располагаются процедуры-обработчики событий прикладных объектов (например СправочникОбъектИмя справочника), такие как ПередЗаписью, ПередУдалением?",

  "options": [
    "В модуле формы",
    "В модуле объекта",

    "В модуле приложения",
    "Таких событий у прикладных объектов нет",
    "В модуле менеджера"

  ],
  "correct": 1
},

{
  "text": "Что такое \"системные перечисления\"?",
  "options": [
    "Перечень значений, заданный на этапе разработки конфигурации (ветвь Перечисления в дереве конфигурации)",
    "Перечень значений, заданный в платформе \"1С:Предприятие 8\"",
    "Конструкция встроенного языка, используемая разработчиком для объявления перечислимых типов данных",

    "Системные перечисления отсутствуют в системе \"1С:Предприятие 8\""
  ],
  "correct": 1
},
{

  "text": "Какая коллекция из нижеперечисленных не относится к универсальным?",
  "options": [
    "Массив",
    "СписокЗначений",
    "ДеревоЗначений",

    "Коллекция строк табличной части документа",
    "Верны ответы 2 и 3 и 4",
    "Верны ответы 3 и 4"
  ],
  "correct": 3

},
{
  "text": "Что необходимо для того, чтобы написанная программистом процедура дополнила контекст документа (объекта типа ДокументОбъект.ИмяДокумента)?",
  "options": [

    "Она должна быть определена в модуле объекта документа",
    "Она должна быть определена в общем модуле",
    "Она должна быть определена с ключевым словом Экспорт",
    "Одновременно должны выполняться условия 1 и 3",

    "Одновременно должны выполняться условия 2 и 3",
    "Одновременно должны выполняться условия 1 и 3 или 2 и 3"
  ],
  "correct": 3

},
{
  "text": "В каком свойстве хранится время документа?",

  "options": [
    "Время",
    "ВремяДок",

    "Дата",
    "Нет правильного ответа"
  ],
  "correct": 2

},
{

  "text": "Для чего предназначен объект ДокументСписок?",
  "options": [
    "Для перебора (выборки) документов средствами встроенного языка",

    "Для управления списком документов, выводимых в табличное поле, т.е. для решения интерфейсных задач",
    "Для операций над документами как объектами базы данных, создания и удаления документов",
    "Верны ответы 1 и 2"

  ],
  "correct": 1

},
{
  "text": "С какого значения начинается индексирование элементов коллекций?",

  "options": [
    "0 (с нуля)",
    "1 (с единицы)",
    "С начального индекса, заданного программистом при создании коллекции",
    "Элементы коллекций не индексируются"

  ],
  "correct": 0
},
{
  "text": "Объект какого типа позволяет изменить данные элемента справочника в базе данных?",

  "options": [
    "СправочникМенеджер",
    "СправочникОбъект",
    "СправочникСсылка",
    "Все перечисленные объекты",
    "Верны ответы 1 и 2"
  ],
  "correct": 1

},
{
  "text": "Какие утверждения относительно NULL справедливы?",
  "options": [
    "NULL -- это литерал",
    "NULL -- относится к примитивным типам данных",
    "NULL -- обозначает отсутствующее значение",
    "Верны все перечисленные ответы",

    "Верны ответы 2 и 3"
  ],
  "correct": 3
},
{
  "text": "В выражении использована конструкция: ?(Сумма&lt;12000, Сумма*0.12, Сумма*0.2). Каким будет результат выражения, если переменная Сумма имеет значение 10000?",
  "options": [
    "1200",

    "1440",
    "0,12",
    "2000",
    "Данная конструкция использована некорректно"
  ],
  "correct": 0
},

{
  "text": "Какого типа является свойство глобального контекста \"Справочники\"?",
  "options": [
    "СправочникиМенеджер",
    "СправочникМенеджер",
    "СправочникОбъект",

    "СправочникВыборка",
    "СправочникСсылка"
  ],
  "correct": 0
},
{

  "text": "Какой литерал представляет значение типа \"дата\" по умолчанию (пустая дата)?",
  "options": [
    "1010001",
    "1010001000000",
    "10101",
    "10101000000",

    "Верны ответы 1 и 2",
    "Верны ответы 3 и 4"
  ],
  "correct": 5
},
{

  "text": "Как можно обратиться к менеджеру справочника \"Номенклатура\"?",
  "options": [
    "Спр = СоздатьОбъект(\"Справочник.Номенклатура\")",
    "Спр = Справочники.Номенклатура",
    "Спр = Новый Справочник.Номенклатура",

    "Верны ответы 2 и 3"
  ],
  "correct": 1
},

{
  "text": "Где может размещаться описание процедуры-обработчика команды формы, определенной разработчиком прикладного решения?",
  "options": [
    "В модуле формы",
    "В модуле объекта",

    "В общем модуле",

    "В модуле менеджера",
    "Возможно либо в модуле формы, либо в модуле объекта. Определяется разработчиком"

  ],
  "correct": 0
},
{

  "text": "Что необходимо выполнить в процедуре \"ОбработкаПроведения\" в модуле документа для отмены проведения?",
  "options": [
    "СтатусВозврата(0)",
    "Отказ = Истина",
    "Отказ = Ложь",

    "Режим = Ложь",
    "РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения"
  ],
  "correct": 1
},
{
  "text": "Пусть Переменная1 имеет тип Дата (состав даты - \"Дата\") и значение, равное 1 марта 2021 года. Чему будет равно значение выражения \"Переменная1+20\"?",
  "options": [

    "21 марта 2021 г 00 ч 00 мин 00 сек",
    "1 марта 2021 г 00 ч 00 мин 20 сек",
    "1 марта 2021 г 20 ч 00 мин 00 сек",
    "1 марта 2041 г 00 ч 00 мин 00 сек",
    "Возникнет ошибка преобразования типов"
  ],
  "correct": 1

},
{
  "text": "В каком обработчике события модуля объекта можно отказаться от записи объекта, например, элемента справочника?",
  "options": [
    "ПередЗаписью",
    "ПриЗаписи",
    "ПослеЗаписи",

    "В любом из перечисленных",
    "Верны варианты 1 и 2 (т.к. такого обработчика события нет в модуле объекта)",
    "Верны варианты 1 и 2 (т.к. обработчик события выполняется \"после\" записи)"
  ],
  "correct": 4
},

{
  "text": "Какое значение будет стоять в полях записей результата запроса, для которых не найдено соответствия в другой таблице-источнике при внешнем соединении?",
  "options": [
    "Неопределено",
    "NULL",
    "0",

    "Пустая ссылка"
  ],
  "correct": 1
},
{
  "text": "При определении обработчика события на COM объект количество параметров в процедуре - обработчике:",

  "options": [
    "равно количеству параметров соответствующего события объекта",
    "на один параметр больше, чем у соответствующего события объекта (первый параметр содержит сам COM объект)",
    "на один параметр больше, чем у соответствующего события объекта (последний параметр содержит сам COM объект)",
    "у такой процедуры не будет параметров",

    "всегда один параметр (сам COM объект)"
  ],
  "correct": 0
},
{

  "text": "При определении подписки на событие количество параметров в процедуре - обработчике:",
  "options": [
    "равно количеству параметров соответствующего обработчика события, располагаемого в модуле объекта",
    "на один параметр больше, чем у соответствующего обработчика события, располагаемого в модуле объекта (первый параметр содержит сам объект)",

    "на один параметр больше, чем у соответствующего обработчика события, располагаемого в модуле объекта (последний параметр содержит сам объект)",
    "у такой процедуры не будет параметров",
    "всегда один параметр (сам объект, для которого определялась подписка)"
  ],
  "correct": 1

},
{
  "text": "При определении обработчика события на экземпляр объекта 1С:Предприятие количество параметров в процедуре - обработчике:",
  "options": [
    "равно количеству параметров соответствующего обработчика события, располагаемого в модуле объекта",

    "на один параметр больше, чем у соответствующего обработчика события, располагаемого в модуле объекта (первый параметр содержит сам объект)",
    "на один параметр больше, чем у соответствующего обработчика события, располагаемого в модуле объекта (последний параметр содержит сам объект)",
    "у такой процедуры не будет параметров",
    "всегда один параметр (сам объект, для которого определялась подписка)"

  ],
  "correct": 1
},
{
  "text": "При определении подписки на событие процедура - обработчик должна располагаться:",

  "options": [
    "в глобальном общем модуле",
    "в не глобальном общем модуле",
    "в модуле приложения",
    "в модуле объекта"
  ],
  "correct": 1
},
{

  "text": "При назначении обработчика события на объект (экземпляр объекта 1С:Предприятие, COM объект) процедура, отвечающая за отработку данного события должна быть расположена:",
  "options": [
    "обязательно в глобальном общем модуле",
    "обязательно в не глобальном общем модуле",
    "обязательно в модуле приложения",
    "выбор модуля не важен, в \"пределах видимости\""
  ],

  "correct": 3
},
{
  "text": "С помощью команды \"ДобавитьОбработчик\" можно назначить обработчик события на:",
  "options": [
    "COM объект",
    "экземпляр объекта 1С:Предприятие (назначать на события модуля объекта)",
    "экземпляр объекта \"Форма\"",
    "верны 1, 2 ответы",
    "верны 1, 2, 3 ответы"
  ],

  "correct": 3
},
{
  "text": "Какая процедура выполняет обработку события ввода документа \"на основании\"?",
  "options": [
    "\"ОбработкаЗаполнения\" с формальным параметром \"Основание\" произвольного типа",
    "\"ВводНаОсновании\" с формальным параметром \"Основание\" типа \"Документ\"",

    "\"ОбработкаЗаполнения\" с формальным параметром \"Основание\" типа \"Документ\"",
    "Ввода документа \"на основании\" не требует дополнительных методов обработки, т.к. это процесс полностью автоматический"
  ],
  "correct": 0
},
{
  "text": "Какой метод документа обеспечивает вызов события проведения документа?",

  "options": [
    "Записать(РежимЗаписиДокумента.Проведение), где Записать - метод объекта документа",
    "Провести(), где Провести - метод объекта документа",
    "Записать(РежимЗаписиДокумента.Проведение), где Записать - метод формы документа",
    "Провести(), где Провести - метод формы документа"
  ],

  "correct": 0
},
{
  "text": "Какой метод документа обеспечивает вызов события отмены проведения документа?",
  "options": [
    "Записать(РегистрацияДокумента.ОтменаПроведения), где Записать - метод объекта документа",

    "ОтменитьПроведение(), где ОтменитьПроведение - метод объекта документа",
    "ОтменитьПроведение(), где ОтменитьПроведение - метод формы документа",
    "Записать(РежимЗаписиДокумента.ОтменаПроведения), где Записать - метод формы документа"
  ],
  "correct": 0

},
{
  "text": "При определении подписки на событие количество таких подписок:",

  "options": [
    "Только одна",
    "Любое количество, процедуры обработчики должны обязательно располагаться в разных общих неглобальных модулях",
    "Любое количество, процедуры обработчики могут располагаться как в одном, так и в разных общих неглобальных модулях"
  ],

  "correct": 2
},
{
  "text": "При определении на одно событие объекта 1С:Предприятие нескольких подписок на событие, порядок вызова обработчиков следующий:",
  "options": [
    "вызывается процедура подписки на событие, определенная последней, остальные не вызываются",
    "вызывается процедура подписки на событие, определенная первой, остальные не вызываются",

    "процедуры вызываются в соответствии с порядком создания подписок на событие",
    "процедуры вызываются в произвольном порядке"
  ],
  "correct": 3
},
{
  "text": "При определении подписки на событие, в случае если в модуле объекта определен соответствующий обработчик этого же события:",

  "options": [
    "процедура подписки на событие вызываться не будет (событие отрабатывается в модуле объекта)",
    "процедура модуля объекта вызываться не будет (событие отрабатывается по подписке)",
    "в начале отработает процедура, расположенная в модуле объекта, затем процедура, определенная по подписке",
    "в начале отработает процедура, определенная по подписке, затем процедура, расположенная в модуле объекта"
  ],
  "correct": 2
},
{

  "text": "Подписка на событие может быть определена:",
  "options": [
    "только для одного объекта",
    "для разных объектов, но только одного вида (например, для нескольких справочников или для нескольких документов)",
    "для разных объектов"
  ],

  "correct": 2
},
{
  "text": "При определении подписки на событие для разных объектов перечень показываемых событий формируется по принципу:",
  "options": [
    "должно совпадать количество параметров события",
    "должно совпадать имя события",

    "должны выполняться оба вышеприведенных требования"
  ],
  "correct": 1
},
{

  "text": "Обработчик события, вызываемый системой (в случае его определения) для формирования представления объекта располагается в",
  "options": [
    "модуле приложения",
    "модуле менеджера",
    "модуле объекта",
    "модуле основной формы объекта",

    "на усмотрение разработчика"
  ],
  "correct": 1
},

{
  "text": "Пессимистическая блокировка объекта (метод Заблокировать()):",
  "options": [
    "не позволяет программно менять данные объекта",

    "позволяет программно менять данные объекта, но только если он заблокирован через ту же переменную, через которую и будет производиться изменение данных объекта",

    "блокировка объекта не мешает программно менять данные объекта"
  ],
  "correct": 2

},
{
  "text": "Если объект заблокирован (с помощью метода Заблокировать()), и система взаимодействия доступна, то в автоматически созданной платформой форме объекта",
  "options": [
    "нельзя изменять данные этого объекта",

    "можно изменять данные, но только если он заблокирован через какую-либо другую форму",
    "можно изменять данные, но при этом будут утеряны изменения сделанные другим пользователем",
    "можно, без каких-либо условий"

  ],
  "correct": 2
},
{

  "text": "Тип анализа \"Кластеризация\" подразумевает:",
  "options": [
    "Поиск часто встречаемых вместе групп объектов или значений характеристик",

    "Поиск цепочек событий",
    "Построение иерархической структуры классифицирующих правил",
    "Разделение исходного набора на группы объектов",
    "Получение общестатистических показателей в виде дерева"
  ],
  "correct": 3

},
{
  "text": "Тип анализа \"Дерево решений\" подразумевает:",

  "options": [
    "Поиск часто встречаемых вместе групп объектов или значений характеристик",

    "Поиск цепочек событий",
    "Построение иерархической структуры классифицирующих правил",
    "Разделение исходного набора на групп объектов",

    "Получение общестатистических показателей в виде дерева"
  ],

  "correct": 2
},

{

  "text": "Тип анализа \"Поиск ассоциаций\" подразумевает:",
  "options": [
    "Поиск часто встречаемых вместе групп объектов или значений характеристик",
    "Поиск цепочек событий",

    "Построение иерархической структуры классифицирующих правил",
    "Разделение исходного набора на групп объектов",
    "Получение общестатистических показателей в виде дерева"
  ],
  "correct": 0
},
{

  "text": "Тип анализа \"Поиск последовательностей\" подразумевает:",
  "options": [
    "Поиск часто встречаемых вместе групп объектов или значений характеристик",
    "Поиск цепочек событий",
    "Построение иерархической структуры классифицирующих правил",
    "Разделение исходного набора на групп объектов",

    "Выявления последовательно расположенных объектов"
  ],
  "correct": 1
},
{
  "text": "Объект МодельПрогноза создается:",

  "options": [
    "С использованием конструктора \"Новый\"",
    "При обращении к одноименному свойству глобального контекста",
    "Из результата анализа данных"
  ],
  "correct": 2

},
{
  "text": "У регистра сведений установлен режим записи \"Независимый\". Редактирование осуществляется в диалоге, ни одна из форм регистра не определена. При попытке интерактивного добавления в него \"Записи\" со значениями измерений, комбинация которых уже прописана в регистре:",
  "options": [

    "На экран выводится предупреждение, но запись все равно записывается в базу данных",
    "Возникает ошибочная ситуация, запись не выполняется",
    "Происходит замещение записи",
    "Интерактивная запись в такой регистр невозможна"
  ],

  "correct": 1
},
{
  "text": "При проведении документа по какому-либо регистру в случае если у документа установлен автоматический режим управления транзакционными блокировками, а у регистра управляемый (в свойствах конфигурации используется вариант \"Автоматический и управляемый\"), то такое проведение приведет:",
  "options": [
    "к возникновению ошибочной ситуации",

    "вся транзакция будет выполнена в автоматическом режиме",
    "вся транзакция будет выполнена в управляемом режиме"
  ],
  "correct": 1

},
{
  "text": "При проведении документа по какому-либо регистру в случае если у документа установлен управляемый режим управления транзакционными блокировками, а у регистра автоматический (в свойствах конфигурации используется вариант \"Автоматический и управляемый\"), то такое проведение приведет:",
  "options": [
    "к возникновению ошибочной ситуации",

    "вся транзакция будет выполнена в автоматическом режиме",
    "вся транзакция будет выполнена в управляемом режиме"
  ],

  "correct": 0
},

{
  "text": "При проведении документа по какому-либо регистру в случае если у документа установлен автоматический режим управления транзакционными блокировками, а у регистра управляемый (в свойствах конфигурации используется вариант \"Управляемый\"), то такое проведение приведет:",
  "options": [
    "к возникновению ошибочной ситуации",

    "вся транзакция будет выполнена в автоматическом режиме",
    "вся транзакция будет выполнена в управляемом режиме"
  ],
  "correct": 2

},
{
  "text": "Алгоритмы в модуле управляемой формы могут исполняться:",
  "options": [
    "только на клиентском компьютере",

    "только на сервере",
    "место исполнения определяется настройками модуля",
    "место определяется для каждой процедуры и функции модуля",

    "возможность зависит от объектов встроенного языка"
  ],
  "correct": 3

},
{
  "text": "Алгоритмы в модуле обычной формы могут исполняться?",

  "options": [
    "Только на клиентском компьютере",
    "Только на сервере",

    "Возможность определяется настройками модуля",
    "Возможность определяется для каждой процедуры и функции модуля",
    "Обычный параметр существует только при открытии формы, ключевой -- только при закрытии формы"

  ],
  "correct": 0
},

{
  "text": "Существует ли в 1С:Предприятии 8 возможность настроить конкретное прикладное решение на использование региональных настроек чисел, дат и времени?",
  "options": [

    "Да, в региональных установках информационной базы можно настроить эти параметры",
    "В региональных установках информационной базы можно настроить только формат даты и времени",

    "В региональных установках информационной базы можно настроить только формат даты и чисел",
    "В 1С:Предприятие 8 такой возможности не существует"

  ],
  "correct": 0
},
{
  "text": "К чему приведет изменение кода языка в свойстве \"Код языка\", если уже введены тексты в свойствах \"Синоним\" или \"Заголовок\" на этом языке?",
  "options": [
    "К \"потере\" введенных текстов без возможности \"восстановления\"",
    "К \"потере\" введенных текстов с возможностью \"восстановления\" при указании прежнего значения кода языка",
    "К потере данных это действие не приведет, введенные тексты будут соответствовать языку с новым кодом"
  ],

  "correct": 1
},
{
  "text": "К каком модуле должно находиться описание процедуры-метода, если обращение к ней идет следующим образом: Справочники.Номенклатура.Метод1(); ?",
  "options": [
    "Модуль приложения",
    "Глобальный общий модуль",
    "Не глобальный общий модуль",
    "Модуль менеджера",
    "Модуль объекта",
    "Модуль формы"

  ],
  "correct": 3
},
{
  "text": "К каком модуле должно находиться описание процедуры-метода, если обращение к ней идет следующим образом: Справочники.Номенклатура.СоздатьОбъект.Метод1(); ?",
  "options": [
    "Модуль приложения",
    "Глобальный общий модуль",
    "Не глобальный общий модуль",
    "Модуль менеджера",
    "Модуль объекта",
    "Модуль формы"
  ],

  "correct": 4
},
{
  "text": "Если в региональных установках информационной базы ни одно из свойств установлено не будет, тогда",
  "options": [
    "язык и форматы отображения чисел, даты и времени будут определяться настройками операционной системы",
    "язык и форматы отображения чисел, даты и времени будут определяться настройками технологической платформы 1С",
    "нет правильного ответа"
  ],

  "correct": 0
},
{
  "text": "Что такое локализация?",
  "options": [
    "Адаптация программы под конкретные национальные требования",
    "Перевод программы на другой язык",
    "Ограничение на доступ к базам для различных категорий пользователей",
    "Процесс создания территориально распределенных информационных баз"
  ],
  "correct": 0

},
{
  "text": "Для чего применяется код локализации?",
  "options": [
    "Для указания региональных установок информационной базы",
    "В форматных строках во встроенном языке для упрощения адаптации решений к конкретным региональным установкам",
    "Для идентификации программного продукта",
    "Верны ответы 1 и 2",
    "Верны ответы 1 и 3"

  ],
  "correct": 3
},
{
  "text": "На что влияют региональные установки информационной базы?",
  "options": [

    "На формат отображения чисел и дат",
    "На интерфейс 1С:Предприятие",
    "На порядок сортировки строк в базе данных",
    "Верно все вышеперечисленное",
    "Верны варианты 1 и 3"
  ],
  "correct": 4
},

{
  "text": "Создание многоязыковых прикладных решений",
  "options": [
    "возможно только в специальной версии программы 1С:Предприятие 8",
    "в 1С:Предприятие 8 невозможно, так как программный продукт уже локализован",
    "возможно благодаря тому, что существует возможность создания нескольких языков в конфигурации и локализованных интерфейсов платформы"

  ],
  "correct": 2
},

{
  "text": "Блокировка устанавливаемая формой объекта при начале редактирования его данных держится до:",
  "options": [
    "записи объекта",

    "закрытия формы",
    "записи, или закрытия формы (в зависимости от того, какое событие будет раньше)"
  ],

  "correct": 0
},
{
  "text": "Блокировка устанавливаемая методом \"ЗаблокироватьДанныеФормыДляРедактирования()\" (с указанием идентификатора формы) держится до:",
  "options": [

    "записи объекта из этой формы",
    "закрытия формы",
    "записи, или закрытия формы (в зависимости от того, какое событие будет раньше)",
    "окончания серверного вызова"
  ],

  "correct": 1
},
{
  "text": "Блокировка устанавливаемая в управляемой форме методом \"Заблокировать()\" держится до...",

  "options": [
    "записи объекта из этой формы",
    "закрытия формы",
    "записи, или закрытия формы (в зависимости от того, какое событие будет раньше)",

    "окончания серверного вызова"
  ],
  "correct": 3
},

{
  "text": "Метод объекта \"Заблокирован()\" позволяет получить информацию о :",
  "options": [

    "блокировке объекта в системе",
    "блокировке объекта в текущем сеансе",
    "блокировке объекта через объект, к которому этот метод был применен",
    "блокировке объекта сделанной текущим пользователем"

  ],
  "correct": 2
},

{
  "text": "Для проверки заблокирован ли объект (пессимистическая блокировка) необходимо использовать метод:",
  "options": [

    "Заблокирован",
    "Заблокировать",

    "ЗаблокироватьДанныеФормыДляРедактирования",
    "Варианты 2 или 3"
  ],

  "correct": 3
},

{
  "text": "Для чего предназначен объект конфигурации \"Язык\"?",

  "options": [
    "Для создания интерфейса программы на разных языках",
    "Для создания текстовых документов на разных языках",
    "Такого объекта в 1С:Предприятие 8 не существует"

  ],
  "correct": 0
},
{
  "text": "Каким образом можно сменить язык просмотра (редактирования) конфигурации?",

  "options": [
    "С помощью кнопки выбора языка, расположенной в строке состояния справа от кнопки \"NUM\"",
    "Через пункт меню \"Конфигурация -- Язык редактирования конфигурации\"",
    "В 1С:Предприятие такой возможности не существует",
    "Верны ответы 1 и 2"
  ],
  "correct": 3

},
{
  "text": "С какой целью используется встроенный язык?",
  "options": [
    "Для определения интерфейса программы по умолчанию",
    "Для описания (на стадии разработки конфигурации) алгоритмов функционирования прикладной задачи",

    "Нет правильного ответа"
  ],
  "correct": 1
},
{

  "text": "Что обозначает параметр Л(L) в форматной строке функции форматирования ЧислоПрописью()?",
  "options": [
    "Признак \"дробную часть выводить числом/прописью\"",
    "Количество знаков после запятой",
    "Код локализации"
  ],

  "correct": 2
},
{
  "text": "При настройке ограничения доступа к данным допускается установка нескольких (по числу полей) ограничений:",
  "options": [

    "Для права \"Чтение\"",
    "Для права \"Изменение\"",
    "Для права \"Добавление\"",
    "Для права \"Удаление\"",

    "Для всех вышеперечисленных прав",
    "Для всех возможных прав"
  ],
  "correct": 0
},

{
  "text": "При настройке ограничения доступа к данным в качестве значений, по которым производится ограничения доступа к данным, могут использоваться:",
  "options": [
    "Значения параметров сеанса",

    "Данные из таблиц (запросов)",
    "Значения имеющие типы: Число, Строка, Булево, Дата",
    "Варианты 1 и 2",
    "Варианты 1 и 3",

    "Варианты 1 и 2 и 3"
  ],
  "correct": 5

},
{
  "text": "Каким из вышеперечисленных способов можно воспользоваться, чтобы в разделе \"Поля\" конструктора запросов появились код и наименование справочника?",
  "options": [

    "Сначала заполнить раздел \"Таблицы\", а потом, выбирая нужные объекты из этого раздела, перенести их в раздел \"Поля\", используя двойной клик левой клавиши мыши",
    "Не заполняя раздел \"Таблицы\", сразу выбирать нужные объекты из таблиц - источников данных раздела \"База данных\", перенося их в раздел \"Поля\", используя технологию Drag & Drop. Раздел \"Таблицы\" заполняется автоматически",
    "Сначала заполнить раздел \"Таблицы\", а потом, выбирая нужные объекты из этого раздела, перенести их в раздел \"Поля\", используя кнопки на форме \">\", \">>\"",

    "Верны ответы 1 и 3",
    "Верны ответы 1, 2 и 3"
  ],
  "correct": 4
},
{

  "text": "Для повышения скорости выполнения запроса с условием (в случае, когда это не противоречит прикладной логике) необходимо:",
  "options": [
    "Задать соответствующий параметр реальной таблицы",
    "Задать соответствующий параметр виртуальной таблицы",
    "Вместо задания параметров у реальной или виртуальной таблицы использовать отбор, заданный конструкцией языка запросов \"ГДЕ\"",
    "Вместо задания параметров у реальной или виртуальной таблицы использовать отбор, заданный конструкцией языка запросов \"ИМЕЮЩИЕ\"",
    "Верны ответы 1 и 2"

  ],
  "correct": 1
},
{
  "text": "Можно ли при выборе таблицы-источника в раздел \"Таблицы\" конструктора запросов задавать для нее новое имя (псевдоним)?",
  "options": [
    "Да, можно",
    "Да, можно, но только если в качестве источника данных выступает вложенный запрос",
    "Да, можно, но только если в качестве источника данных выступает виртуальная таблица",
    "Верны ответы 1 и 2",
    "Верны ответы 1 и 3"
  ],
  "correct": 0
},

{
  "text": "Вложенный запрос может использоваться:",
  "options": [
    "В качестве таблицы-источника данных",
    "В качестве операнда операций сравнения \"В\" или \"НЕ В\" при задании параметров виртуальной таблицы",
    "В качестве операнда операций сравнения \"В\" или \"НЕ В\" при задании конструкции языка запросов \"ГДЕ\"",
    "Верны ответы 1, 2 и 3"
  ],
  "correct": 3
},
{
  "text": "Можно ли, используя конструктор запроса, получить итоги по иерархии?",
  "options": [
    "Можно, если для итогового группировочного поля указать тип итогов \"Элементы и иерархия\"",
    "Можно, если для итогового группировочного поля указать тип итогов \"Только иерархия\"",
    "Можно, если для итогового группировочного поля указать тип итогов \"Элементы\"",
    "Можно, при этом ничего делать не нужно итоги по иерархии получаются системой автоматически",
    "Варианты 1 и 2",

    "Варианты 1 и 2 и 3"
  ],
  "correct": 4
},
{
  "text": "На закладке \"Условия\" конструктора запросов отдельная строка списка условий может быть сформирована:",
  "options": [
    "С помощью двойного клика левой клавиши мыши на нужном поле в списке доступных полей",
    "Путем переноса нужного поля в список, используя технологию Drag & Drop",
    "Нажать кнопку \"Добавить\". Если условие произвольное, то текст условия можно ввести \"вручную\"",
    "Вызвав контекстное меню, выбрать в нем пункт \"Добавить\". Возможно использование произвольного выражения",
    "Верны все вышеперечисленные ответы"
  ],
  "correct": 4
},
{

  "text": "При соединении таблиц-источников данных в конструкторе запросов можно:",
  "options": [
    "Назначить соединение без указания условия связи",
    "Назначить соединение с указанием условия связи, причем это условие может быть только одно",
    "Назначить соединение с указанием условия связи, причем это условие может быть только простое",
    "Назначить необходимое количество соединений с указанием необходимого количества условий связи, причем эти условия могут быть как простые, так и произвольные"
  ],
  "correct": 3
},
{
  "text": "На закладке \"Связи\" конструктора запросов можно определить:",
  "options": [
    "Соединение таблиц-источников данных и связи между ними",
    "Объединение таблиц-источников данных и связи между ними",
    "Связи между полями таблицы, получаемой в результате выполнения запроса",

    "Связи между полями таблицы-источника данных и таблицы, получаемой в результате выполнения запроса"
  ],
  "correct": 0
},
{
  "text": "Создание соединения таблиц-источников данных в конструкторе запросов допускает:",
  "options": [
    "Соединение только двух таблиц-источников данных",
    "Соединение необходимого количества таблиц-источников данных",
    "Соединение только двух таблиц-источников данных, причем флажок \"Все\" обязательно должен быть проставлен хотя бы у одной из таблиц",
    "Соединение необходимого количества таблиц-источников данных, причем флажок \"Все\" обязательно должен быть проставлен хотя бы у одной из таблиц"
  ],
  "correct": 1

},
{
  "text": "Флажок \"Все\", устанавливаемый у таблицы, выбранной на закладке \"Связи\" конструктора запросов означает:",
  "options": [
    "Что в результат запроса надо включить все доступные поля этой таблицы",
    "Что в результат запроса надо включить все записи этой таблицы",
    "Что в результат запроса надо включить все поля и все записи этой таблицы",
    "Что результат запроса будет сформирован с учетом всех условий, заданных для соединения таблиц-источников"
  ],
  "correct": 1
},

{
  "text": "На закладке \"Объединения/Псевдонимы\" конструктора запросов можно:",
  "options": [
    "Задать список запросов. В результирующую выборку попадут записи всех указанных запросов",
    "Задать имена полей результирующей таблицы",
    "Задать имена таблиц-источников данных",
    "Верны ответы 1 и 2",
    "Верны ответы 1, 2 и 3"
  ],
  "correct": 3
},

{
  "text": "При объединении двух запросов на закладке \"Объединения/Псевдонимы\" конструктора запросов условие связи между запросами:",

  "options": [
    "Должно быть задано обязательно",
    "Может быть задано, если этого требует логика построения всего запроса",
    "Условие связи между запросами задать нельзя"
  ],

  "correct": 2

},
{

  "text": "Можно ли, используя конструктор запроса, повлиять на порядок записей в результирующей таблице запроса?",
  "options": [
    "Нельзя",
    "Это можно сделать на закладке \"Порядок\"",

    "Это можно сделать на закладке \"Объединения/Псевдонимы\"",
    "Верны ответы 2 и 3"
  ],

  "correct": 3
},
{
  "text": "Отразятся ли настройки, сделанные в разделе \"Объединения/Псевдонимы\" конструктора запросов, на информацию, отображаемую в других разделах конструктора?",

  "options": [
    "Нет, вид остальных разделов конструктора запросов остается без изменений",
    "Да, в конструкторе запросов появляется закладка \"Связи\"",

    "Да. Если заданы псевдонимы полей результирующей таблицы, то новые названия появляются на закладке \"Порядок\" в списке полей",
    "Да. При объединении запросов на ряде закладок (в том числе \"Таблицы и поля\") появляется возможность переключения между объединяемыми запросами",
    "Верны ответы 2 и 3",

    "Верны ответы 3 и 4"
  ],
  "correct": 5
},

{
  "text": "При создании запросов, участвующих в объединении, с помощью конструктора запросов обязательно ли у всех запросов должно быть одинаковое количество полей в списке выборки?",

  "options": [

    "Да. Поля результата запроса формируются по списку полей первого из объединяемых запросов, а поля остальных объединяемых запросов сопоставляются с полями результата по имени",
    "Нет. Конструктор сам добавит в каждый запрос необходимое количество недостающих полей со значением NULL. Настроить соответствие добавленных конструктором полей и полей результата запроса можно на закладке \"Объединения/Псевдонимы\"",

    "Да. Поля результата запроса формируются по списку полей первого из объединяемых запросов, а поля остальных объединяемых запросов сопоставляются с полями результата по их порядку"

  ],
  "correct": 1
},

{
  "text": "В случае установки флага \"Автоупорядочивание\" на закладке \"Порядок\" конструктора запросов, как изменится порядок записей в результирующей таблице запроса, если эта таблица уже упорядочена по полю, хранящему ссылку на иерархический справочник?",
  "options": [
    "Не изменится",

    "Записи в результирующей таблице будут упорядочены по внутренней ссылке этого поля",
    "Записи в результирующей таблице будут упорядочены по значению основного представления для этого поля"
  ],
  "correct": 2

},
{
  "text": "Можно ли установить флаг \"Автоупорядочивание\" на закладке \"Порядок\" конструктора запросов, если на этой закладке не заданы настройки?",
  "options": [
    "Можно, записи в результирующей таблице запроса будут упорядочены по полям сортировки по умолчанию для таблиц-источников данных",
    "Можно, если заданы настройки на станицах \"Группировка\" или \"Итоги\". Порядок записей в результирующей таблице запроса будет определяться этими настройки",
    "Верны ответы 1 и 2",
    "Нельзя",

    "Можно, но никакого упорядочивания не будет"
  ],
  "correct": 2
},
{
  "text": "В каких разделах языка запросов нельзя использовать псевдонимы полей",
  "options": [
    "ГДЕ",
    "СГРУППИРОВАТЬ ПО",
    "УПОРЯДОЧИТЬ ПО",

    "ИТОГИ",
    "Варианты 1 и 2",
    "Варианты 1 и 2 и 3"
  ],
  "correct": 4
},
{
  "text": "Флаг \"Без повторяющихся записей\" на закладке \"Дополнительно\" конструктора запросов позволяет:",
  "options": [

    "Если в таблице источнике есть записи в которых значение хотя бы одного из выбираемых полей совпадает, то в результат запроса попадет только одна из них (действует только на детальные записи)",
    "Если в таблице источнике есть записи в которых значения во всех выбираемых полях совпадают, то в результат запроса попадет только одна из них (действует только на детальные записи)",
    "Если в таблице источнике есть записи в которых значение хотя бы одного из выбираемых полей совпадает, то в результат запроса попадет только одна из них (действует и на детальные и на итоговые записи)",
    "Если в таблице источнике есть записи в которых значения во всех выбираемых полях совпадают, то в результат запроса попадет только одна из них (действует и на детальные и на итоговые записи)"

  ],
  "correct": 2
},
{
  "text": "Флаг \"Первые 5 записей\" на закладке \"Дополнительно\" конструктора запросов позволяет:",
  "options": [
    "Вывести в отчет первые 5 записей. Записи будут отобраны без учета правил упорядочивания, настроенных в конструкторе запросов",

    "Вывести в отчет первые 5 записей. Записи будут отобраны с учетом правил упорядочивания, настроенных в конструкторе запросов",
    "Вывести в отчет первые 5 записей. В результат попадут первые 5 записей исходя из их физического порядка в таблице (вне зависимости от того настроены правила упорядочивания или нет)"
  ],
  "correct": 1
},

{
  "text": "Флаг \"Для изменения\" (в режиме автоматических транзакционных блокировок) на закладке \"Дополнительно\" конструктора запросов позволяет:",
  "options": [
    "Заблокировать на изменение данные указанных таблиц-источников при выполнении запроса (вне транзакции)",
    "Заблокировать на чтение данные указанных таблиц-источников в запросе (как вне, так и в рамках транзакции)",
    "Заблокировать данные указанных таблиц-источников на чтение (в рамках транзакции)",

    "Верны ответы 1 и 2"

  ],
  "correct": 2
},

{
  "text": "При установке флага \"Для изменения\" (в режиме автоматических транзакционных блокировок) на закладке \"Дополнительно\" конструктора запросов при его выполнении устанавливаются блокировки:",
  "options": [

    "На уровне таблиц базы данных",
    "На уровне записей таблиц базы данных",
    "В файловом варианте базы- на уровне таблиц базы данных",
    "В варианте клиент-сервер - на уровне записей таблиц базы данных",
    "Верны ответы 3 и 4"

  ],
  "correct": 4
},
{
  "text": "При установке флага \"Для изменения\" (в режиме автоматических транзакционных блокировок) на закладке \"Дополнительно\" конструктора запросов будут блокироваться данные:",

  "options": [
    "Всех таблиц-источников в запросе",
    "Только виртуальных таблиц-источников в запросе",
    "Если список \"Таблицы для изменения\" - пуст, то всех таблиц, задействованных в запросе, иначе - только таблиц, указанных в списке"
  ],

  "correct": 2
},
{
  "text": "Какие из следующих утверждений верны?",
  "options": [

    "Конструктор запросов входит в состав конструктора схемы компоновки данных",
    "Конструктор схемы компоновки данных входит в состав конструктор запросов",
    "Конструктор схемя компоновки данных всегда использует конструктор запросов",
    "Варианты 1 и 2",

    "Варианты 2 и 3",
    "Варианты 1 и 3"
  ],

  "correct": 4
},
{
  "text": "Можно ли одним запросом получить данные из таблицы внешнего источника и таблицы базы данных?",

  "options": [
    "Можно, без ограничений",
    "Можно, но только в пакетном запросе (в одном запросе пакета идет получение данных из таблицы базы данных, в другом обращение к таблице внешнего источника и т.п.)",

    "Можно, но при этом можно использовать только объединение данных таблиц",

    "Нельзя"
  ],
  "correct": 3

},
{
  "text": "При выполнении пакетного запроса система в качестве результата предоставляет",
  "options": [

    "Результат выполнения последнего запроса пакета",
    "Коллекцию результатов всех запросов, входящих в пакет",
    "Варианты 1 или 2 в зависимости от используемого метода объекта \"Запрос\""
  ],
  "correct": 2

},
{
  "text": "Результат запроса в котором создается временная таблица содержит:",
  "options": [
    "помещенные во временную таблицу данные",

    "количество записей, помещенных во временную таблицу",
    "структуру с данными помещенными во временную таблицу и количеством этих записей"
  ],
  "correct": 2
},

{
  "text": "При обходе результата запроса с использованием \"ОбходРезультатаЗапроса.ПоГруппировкам\"",
  "options": [
    "В одном цикле обходятся только записи, принадлежащие определенной итоговой группировке",
    "В одном цикле обходятся только записи, принадлежащие определенному уровню иерархии итоговой группировки",

    "Детальные записи не обходятся",
    "Варианты 1 и 3",
    "Варианты 2 и 3"
  ],

  "correct": 0
},
{
  "text": "При обходе результата запроса с использованием \"ОбходРезультатаЗапроса.ПоГруппировкамСИерархией\"",
  "options": [
    "В одном цикле обходятся только записи, принадлежащие определенной итоговой группировке",

    "В одном цикле обходятся только записи, принадлежащие определенному уровню иерархии итоговой группировки",
    "Детальные записи не обходятся итоговой группировки",
    "Варианты 1 и 3",
    "Варианты 2 и 3"

  ],
  "correct": 1
},
{

  "text": "С помощью конструктора запросов можно написать запрос получающий данные из",
  "options": [
    "Таблиц объектов (документов, справочников и т.п.)",

    "Вложенных таблиц объектов",
    "Таблиц регистрации изменений объектов",
    "Варианты 1 и 2",

    "Варианты 1 и 3",
    "Варианты 1 и 2 и 3"
  ],
  "correct": 5

},
{
  "text": "Как изменится количество записей в результате запроса при использовании секции \"ИТОГИ ПО\"?",

  "options": [
    "Количество записей увеличится (по сравнению с их количеством без секции \"ИТОГИ ПО\")",
    "Количество записей останется неизменным (по сравнению с их количеством без секции \" ИТОГИ ПО\")",
    "Количество записей уменьшится (по сравнению с их количеством без секции \"ИТОГИ ПО\")"

  ],
  "correct": 0
},
{
  "text": "При описании группировки в тексте запроса:",
  "options": [
    "Все поля должны делиться на те, по которым производится группировка, и на агрегатные функции (рассчитываемые поля)",
    "Все поля должны делиться на те, по которым производится группировка, на агрегатные функции (рассчитываемые поля) и на поля вложенных таблиц",
    "Чем выше определяется группировка, тем выше должно определяться поле в запросе",
    "Перечисленные ограничения не действуют"
  ],
  "correct": 1
},
{
  "text": "Левое внешнее соединение означает, что в результат соединения войдут:",
  "options": [
    "Все данные из таблицы №2 и они будут дополнены данными из таблицы №1, для которых выполняется условие соединения",

    "Данные из обеих таблиц, для которых выполняется условие соединения, но поля, которые берутся из таблицы №1, будут идти первыми (слева)",
    "Все данные из таблиции №1 и они будут дополнены данными из таблицы №2, для которых выполняется условие соединения"
  ],
  "correct": 2
},
{
  "text": "С помощью какой агрегатной функции можно узнать количество записей в результате запроса?",
  "options": [
    "КОЛИЧЕСТВО()",
    "КОЛИЧЕСТВО(*)",
    "КОЛИЧЕСТВО(Различные ...)",

    "СУММА"
  ],
  "correct": 1
},
{
  "text": "Какими скобками выделяются расширения языка запросов, предназначенные схемы компоновки данных?",
  "options": [
    "Квадратные скобки -- []",
    "Фигурные - {}",
    "Круглые - ()",
    "Не выделяются"
  ],
  "correct": 1
},

{
  "text": "Если в конструкторе запроса при использовании нескольких таблиц очистить закладку \"Связи\" то",
  "options": [
    "Запрос станет не исполняемым",
    "Конструктор запроса не даст это сделать",
    "Запрос отработает исходя из логики, которая в нем заложена"
  ],
  "correct": 2

},
{
  "text": "Текст запроса может содержать описание предопределенных данных конфигурации:",
  "options": [
    "значения системных перечислений",
    "предопределенных данных (справочники, перечисления, планы видов характеристик, планов счетов, планов видов расчета)",
    "пустые ссылки",
    "значения точек маршрута бизнес-процессов",
    "верны ответы 1, 2, 3, 4"

  ],
  "correct": 4
},
{
  "text": "В тексте запроса можно указывать (напрямую, без использования параметров) значения системных перечислений:",
  "options": [
    "из определенного перечня",
    "любые системные перечисления",

    "описать в тексте запроса использование какого-либо значения системного перечисления (без использования параметра запроса) нельзя"
  ],
  "correct": 0
},
{
  "text": "При работе с временными таблицами менеджер временных таблиц:",
  "options": [

    "создается в единственном экземпляре на информационную базу, попытка повторного создания приводит к исключительной ситуации",
    "может быть создан по одному экземпляру на сеанс (запуск 1С:Предприятие)",
    "в рамках одного сеанса может быть создано произвольное количество экземпляров",
    "существует в единственном экземпляре, обращение к нему производится через соответствующее свойство глобального контекста"
  ],
  "correct": 2
},

{
  "text": "Время жизни временной таблицы, созданной в контексте менеджера временных таблиц:",
  "options": [
    "определяется разработчиком при создании временной таблицы",
    "до окончания сеанса, в котором таблица была создана",
    "до окончания процедуры, функции, в которой она была создана",

    "определяется временем жизни менеджера временных таблиц, либо разработчиком с помощью конструкции языка запросов"

  ],
  "correct": 3
},

{
  "text": "При создании временной таблицы, после ключевого слова \"Поместить\" указывается имя временной таблицы. Это имя должно быть:",
  "options": [
    "уникальным в пределах информационной базы",
    "уникальным в пределах пользовательского сеанса",
    "уникальным в пределах менеджера временных таблиц, пакетного запроса",
    "может совпадать с именем существующей временной таблицы, в этом случае произойдет замещение данных в ранее существовавшей таблице"
  ],

  "correct": 2
},
{

  "text": "При написании текста запроса (раздел \"ИЗ\") можно ли вместо имени таблицы указать параметр?",
  "options": [
    "В любом случае (нет ограничений)",
    "Только если в этом запросе создается временная таблица",
    "Только если в этом запросе производится получение данных, а не создание временной таблицы",
    "В любом случае (нет ограничений), но только в подзапросах",

    "В любом случае (нет ограничений), но только в запросе \"верхнего\" уровня"

  ],
  "correct": 1
},
{
  "text": "При использовании в запросе параметра вместо указания имени таблицы, при задании значения параметра может использоваться:",
  "options": [
    "таблица значений",
    "табличная часть",

    "результат запроса",
    "дерево значений",
    "верны ответы 1 или 2 или 3",
    "верны ответы 1 или 2 или 3 или 4"
  ],
  "correct": 4

},
{
  "text": "При определении в виртуальной таблице \"ОстаткиИОбороты\" варианта периодичности \"Авто\":",
  "options": [
    "система автоматически подберет периодичность получения оборотов исходя из правила: чтобы в результате оказалось не менее 3-х значений периодов, но не более 12",

    "система автоматически подберет периодичность получения оборотов исходя из правило: чтобы в результате оказалось не менее 5-ти значений периодов, но не более 10",
    "в полях выборки запроса разработчик сможет выбирать поля периода с разной периодичностью"
  ],
  "correct": 2
},
{
  "text": "При попытке выполнить запрос с текстом \"Выбрать * Из Справочник.Номенклатура\", в случае если на записи справочника были определены ограничения на чтение (в соответствующей роли) произойдет следующее:",

  "options": [
    "Будут получены все данные",
    "Будут получены данные только из разрешенных записей",
    "Произойдет ошибка"

  ],
  "correct": 2
},
{
  "text": "Значения каких реальных полей таблицы документа определяют его хронологическую позицию среди других документов?",
  "options": [

    "Значения свойств \"Дата\" и \"Ссылка\"",
    "\"Момент времени\" документа",
    "\"Момент времени\" документа и \"Ссылка\"",

    "Достаточно значения свойства \"Номер\"",
    "Достаточно значения свойства \"Ссылка\"",
    "Значения свойств \"Дата\" и \"Номер\""
  ],
  "correct": 0

},
{
  "text": "Какие виды форм позволяет использовать Платформа 8.3?",
  "options": [

    "Всегда возможно совместное использование обычных и управляемых форм",
    "Обычные формы только в режиме совместимости с 8.1",
    "Управляемые формы только в режиме управляемого приложения",

    "Возможность использования обычных и управляемых форм зависит от настроек конфигурации и клиентского приложения"
  ],
  "correct": 3

},
{
  "text": "Использование обычных форм возможно:",
  "options": [
    "в толстом клиенте",
    "в тонком клиенте",

    "в веб-клиенте",
    "Варианты 1 и 2",
    "верны все варианты в зависимости от настроек конфигурации"
  ],
  "correct": 0
},

{
  "text": "Использование управляемых форм возможно...",
  "options": [
    "в толстом клиенте в режиме обычного приложения",
    "в толстом клиенте в режиме управляемого приложения",
    "в тонком клиенте",
    "в веб-клиенте",
    "Варианты 1 и 2",
    "верны все варианты в зависимости от настроек конфигурации"
  ],

  "correct": 5
},
{
  "text": "Как реализован механизм автопреобразования обычных форм в управляемые и обратно",
  "options": [
    "С помощью механизма ввода на основании",
    "С помощью изменения свойства формы \"Тип формы\"",
    "С помощью специального конструктора конвертация форм",
    "Автопреобразование не поддерживается"
  ],

  "correct": 3
},
{
  "text": "Для чего служит основной реквизит формы?",
  "options": [
    "Определяет источник данных для формы в целом",
    "Определяет стандартные возможности платформы для работы формы с данными типа, заданного у основного реквизита",
    "Для обеспечения возможности программного обращения к реквизитам объекта из локального контекста формы",
    "Обеспечивает визуализацию реквизитов объекта на диалоге формы",
    "Варианты 1 и 2",

    "Варианты 2 и 3"
  ],
  "correct": 4
},
{
  "text": "Для чего нужны реквизиты формы?",
  "options": [
    "Для описания состава данных, которые отображаются, редактируются или хранятся в форме",
    "Для приема \"внешних\" данных передаваемых форме при открытии",
    "Варианты 1 и 2"
  ],
  "correct": 0

},
{
  "text": "Чтобы произвольной управляемой форме назначить основной реквизит...",
  "options": [
    "форму нужно сделать основной, основной реквизит при этом определяется автоматически",
    "нужно в свойствах реквизита формы установить флажок \"Основной реквизит\"",
    "нужно войти в меню \"Правка\", пункт \"Основной реквизит\" и выбрать нужное значение",
    "нужно заполнить свойство \"Данные\" формы, выбрав нужный реквизит формы",

    "ничего делать не нужно, основной реквизит определяется исходя из того, в подчинении к какому объекту конфигурации эта форма создается"
  ],
  "correct": 1
},
{
  "text": "Чтобы произвольной обычной форме назначить основной реквизит...",
  "options": [

    "форму нужно сделать основной, основной реквизит при этом определяется автоматически",
    "нужно в свойствах реквизита формы установить флажок \"Основной реквизит\"",
    "нужно войти в меню \"Правка\", пункт \"Основной реквизит\" и выбрать нужное значение",
    "нужно заполнить свойство \"Данные\" формы, выбрав нужный реквизит формы",
    "ничего делать не нужно, основной реквизит определяется исходя из того, в подчинении к какому объекту конфигурации эта форма создается"
  ],
  "correct": 3

},
{
  "text": "При наличии одного основного реквизита формы можно ли добавить еще один основной реквизит?",
  "options": [
    "Это невозможно",
    "Можно посредством назначения соответствующего значения свойства реквизита формы",
    "Можно только программно, при обращении к объекту \"Форма\"",
    "Можно посредством добавления еще одного значения к соответствующему свойству формы"
  ],

  "correct": 0
},
{
  "text": "Для чего нужны основные формы прикладных объектов?",
  "options": [
    "Только у основных форм может быть назначен основной реквизит, определяющий состав формы",
    "Основные формы вызываются взамен автоматически генерируемых по умолчанию при соответствующем обращении к объекту",
    "Только из основных форм есть возможность обращаться к контексту объекта напрямую",
    "Только у основных форм возможно использование расширения форм, определяющего специфику состава и поведения формы, отличного от типового"

  ],
  "correct": 1
},
{
  "text": "В качестве основной формы можно назначить?",
  "options": [
    "Только управляемую форму",
    "Только обычную",
    "Обычную и управляемую",
    "Возможность зависит от настроек конфигурации",

    "Возможность зависит от настроек конфигуратора"
  ],
  "correct": 4

},
{

  "text": "Как определяется рабочая область начальной страницы?",
  "options": [
    "Заполняется автоматически генерируемыми формами на основании стандартных команд",

    "Набирается из списка общих форм",
    "Набирается из списка произвольных форм",

    "Набирается из списка основных форм",
    "Набирается из списка любых определенных в конфигураторе форм",
    "Набирается из списка управляемых форм"

  ],
  "correct": 5

},
{

  "text": "Разместить формы в начальной странице можно:",
  "options": [

    "По горизонтали в любом количестве, по вертикали в любом количестве",
    "По горизонтали не более двух, по вертикали не более двух",

    "По горизонтали не более двух, по вертикали в любом количестве",
    "По горизонтали в любом количестве, по вертикали не более двух"

  ],

  "correct": 2

},
{

  "text": "Начальную страницу можно отобразить:",

  "options": [
    "В основном окне",
    "Во вспомогательном окне, удерживая клавишу \"Shift\"",
    "Зависит от настроек конфигурации",

    "Варианты 1 и 2"
  ],
  "correct": 0
},
{

  "text": "Управляемые формы списков можно отобразить:",
  "options": [
    "В основном окне",

    "Во вспомогательном окне",
    "Зависит от настроек формы",
    "Варианты 1 и 2"
  ],
  "correct": 3
},
{
  "text": "Настройка формы в режиме исполнения позволяет:",
  "options": [

    "Изменить видимость существующих на форме элементов управления",
    "Изменять формат, ширину, высоту, текст заголовка и др. свойства элементов управления существующих на форме",
    "Удалять с формы некоторые элементы управления",
    "Добавлять на форму новые элементы управления",
    "Варианты 1 и 2",
    "Верны все варианты"
  ],
  "correct": 5
},

{
  "text": "Настройка списка управляемой формы в режиме исполнения позволяет:",
  "options": [
    "Изменить видимость существующих в списке колонок",
    "Удалять колонки из списка",
    "Добавлять колонки в списке",
    "Изменить порядок, настроить группировки, управлять отбором и условным оформлением записей",
    "Варианты 1 и 4",
    "Верны все варианты"

  ],
  "correct": 3
},
{
  "text": "Какие возможности по настройке порядка обхода элементов в управляемой форме существуют в системе 1С:Предприятие 8?",
  "options": [
    "Порядок обхода единый для всех пользователей и не может изменяться",
    "Порядок обхода единый для всех пользователей, но может изменяться программно",
    "Порядок обхода единый для всех пользователей, но может изменяться программно и интерактивно самим пользователем",
    "Порядок обхода зависит от ролей пользователя и функциональных опций и не может изменяться",

    "Порядок обхода зависит от ролей пользователя и функциональных опций, но может изменяться программно",
    "Порядок обхода зависит от ролей пользователя и функциональных опций, и по своей сути определяется положением элементов в дереве элементов в форме (может меняться программно и интерактивно самим пользователем)"
  ],
  "correct": 5
},
{

  "text": "Панель навигации может существовать:",
  "options": [
    "Только в основном окне на рабочем столе",
    "В основном окне на рабочем столе и в разделах",
    "В основном окне и вспомогательных окнах"
  ],
  "correct": 2
},

{
  "text": "Параметры формы предназначены:",
  "options": [
    "для организации функциональной связи между формами",
    "для управления функциональностью формы при открытии",
    "для отображения информации на форме",

    "Варианты 1 и 2",
    "Верны все варианты"
  ],
  "correct": 3
},

{
  "text": "При наличии одного ключевого параметра можно ли добавить еще один ключевой параметр формы?",
  "options": [
    "Это невозможно",
    "Можно посредством назначения соответствующего значения свойства параметра формы",

    "Можно только программно, при обращении к объекту \"Форма\"",
    "Можно посредством добавления еще одного значения к соответствующему свойству формы"
  ],
  "correct": 1
},
{
  "text": "Чем отличается ключевой параметр формы от обычного?",

  "options": [
    "Ключевой параметр существует только при создании формы, обычный -- всегда",
    "Обычный параметр существует только при создании формы, ключевой -- всегда",
    "Ключевой параметр существует только при открытии формы, обычный -- только при закрытии формы",

    "Обычный параметр существует только при открытии формы, ключевой -- только при закрытии формы"

  ],
  "correct": 1
},
{

  "text": "Для добавления команды в виде кнопки на управляемой форме можно:",
  "options": [
    "разместить на форме элемент управления \"Кнопка\", назначить обработчик события \"Нажатие\" и определить алгоритм в модуле формы",
    "добавить в форму элемент управления \"Кнопка\", назначить команду из списка команд формы и определить алгоритм команды в модуле формы",
    "перетащить команду в дерево элементов",

    "добавить команду формы в командный интерфейс формы и включить ее видимость",

    "Варианты 2 и 3"
  ],
  "correct": 4
},
{
  "text": "Для добавления команды в виде кнопки на обычной форме можно:",
  "options": [
    "разместить на форме элемент управления \"Кнопка\", назначить обработчик события \"Нажатие\" и определить алгоритм в модуле формы",
    "добавить в форму элемент управления \"Кнопка\", назначить команду из списка команд формы и определить алгоритм команды в модуле формы",

    "добавить команду формы в командный интерфейс формы и включить ее видимость",
    "Варианты 2 и 3"
  ],
  "correct": 0
},
{
  "text": "С помощью элемента формы \"Поле индикатора\" можно:",
  "options": [

    "Отобразить текущее состояние реквизита формы любого типа",
    "Отобразить текущее состояние реквизита формы только числового типа",
    "Быстро и наглядно ввести значение любого типа",
    "Быстро и наглядно ввести значение только числового типа",
    "Варианты 1 и 3",

    "Варианты 2 и 4"
  ],
  "correct": 1
},
{
  "text": "На рисунке представлена::<br><img src='diag.png' alt='Диаграмма' width='400'>",

  "options": [
    "Диаграмма",
    "Сводная диаграмма",
    "Дендрограмма",

    "Диаграмма Ганта"
  ],
  "correct": 0
},

{
  "text": "Поведение элементов формы",
  "options": [
    "всегда стандартно",

    "определяется подчинением формы соответствующему прикладному объекту",
    "стандартно, но имеет место специфичное поведение, определяемое расширениями формы, расширениями самих элементов и расширениями, связанными с отображаемыми данными",
    "определяется только расширением формы, расширением элементов управления или отображаемыми данными"
  ],

  "correct": 2
},
{

  "text": "С помощью элемента формы \"Поле переключателя\" можно:",
  "options": [
    "Выбрать одно значение из нескольких заранее определенных вариантов",

    "Выбрать несколько значений из заранее определенных вариантов",
    "Выбрать одно или несколько значений из заранее определенных вариантов"
  ],

  "correct": 0

},
{
  "text": "Возможность системы создания \"налету\" форм по умолчанию в режиме \"1С:Предприятие\"",

  "options": [
    "следует использовать только в тех случаях, когда обращения к данной форме редки, поскольку расходуется большее количество ресурсов системы",
    "следует использовать во всех случаях, когда не требуется выполнение программных действий в форме, и нет особых требований по отношению внешнего вида формы объекта со стороны пользователя",
    "следует использовать только в тех случаях, когда форму необходимо исключить из состава основных",
    "следует использовать только для объектов, обладающих простой структурой"

  ],
  "correct": 1

},
{

  "text": "В управляемом приложении отображать данные в виде диаграммы можно",
  "options": [
    "в отчетах, использующих механизм компоновки данных",
    "в основной форме объекта",
    "в любой форме",
    "Варианты 1 и 2",
    "Варианты 1 и 3"

  ],
  "correct": 4
},
{
  "text": "Для хранения значения элемента формы \"Поле переключателя\" в управляемой форме можно использовать:",
  "options": [
    "Реквизит формы, создаваемый конструктором при добавлении переключателя в форму",

    "Существовавший ранее (предварительно созданный) реквизит формы",
    "Варианты 1 и 2"
  ],
  "correct": 1
},
{
  "text": "При использовании свойства диаграммы \"МаксимумСерийКоличество\", если количество серий превышает максимальное значение:",
  "options": [
    "Выводятся первые серии, количество которых задается этим свойством",
    "Выводятся серии, выбираемы по алгоритму: по каждой серии ищется максимальное точечное значение, эти значения сортируются и из полученного списка выбирается для показа (МаксимумСерийКоличество -1) серий. Остальные серии игнорируются",

    "Выводятся серии, выбираемы по алгоритму: по каждой серии ищется максимальное точечное значение, эти значения сортируются и из полученного списка выбирается для показа (МаксимумСерийКоличество -1) серий. Значения остальных серий суммируются и выводятся в серии \"Сводная\""
  ],
  "correct": 2
},
{
  "text": "Для чего используются привязки в обычной форме?",

  "options": [
    "Для обеспечения управления поведением границ элементов управления при изменении размеров формы",
    "Для обеспечения управления видимостью элементов управления в зависимости от видимости других элементов управления",
    "Для обеспечения управления доступностью элементов управления в зависимости от доступности других элементов управления",
    "Для обеспечения управления доступностью элементов управления в зависимости от видимости или доступности других элементов управления",
    "Верны все варианты"

  ],
  "correct": 0
},
{
  "text": "При расположении в панели обычной формы элементов управления...",
  "options": [
    "их можно привязать к границам панели",

    "их можно привязать к границам элементов управления, расположенным в панели и к границам панели",
    "их можно привязать к границам элементов управления, расположенных в любом месте формы",
    "их можно привязать к границам элементов управления, расположенных в любом месте формы и к границам формы"
  ],
  "correct": 1

},
{
  "text": "Каким образом относительно друг друга могут использоваться элементы формы с типами: \"Группа-Обычная группа\", \"Группа-Страницы\", \"Группа-Страница\"",
  "options": [
    "\"Группа-Страницы\" входит в \"Группа-Обычная группа\"",
    "\"Группа-Страницы\" входит в \"Группа-Страница\"",

    "\"Группа-Обычная группа\" входит в \"Группа-Страницы\"",
    "Варианты 1 и 2",
    "Варианты 1 и 3",
    "Варианты 1 и 2 и 3"

  ],

  "correct": 3
},

{
  "text": "Значение типа \"ЗначениеДиаграммы\" позволяет получить:",
  "options": [
    "Значение диаграммы в определенной точке и серии",
    "Значение расшифровки в определенной точке и серии",
    "Текст подсказки",
    "Варианты 1 и 2",

    "Варианты 1 и 3",
    "Варианты 1 и 2 и 3"
  ],
  "correct": 5
},
{
  "text": "Как включить возможность интерактивной перенастройки порядка обхода элементов управления обычной формы?",
  "options": [
    "Через меню \"Форма\" снять флажок \"Автоматический порядок обхода\"",
    "Снять флажок \"Автопорядок обхода\" в свойствах формы",

    "Снять флажок \"Автопорядок обхода\" в свойствах каждой панели формы"
  ],
  "correct": 2
},
{
  "text": "Элемент формы \"Декорация\" предназначен:",
  "options": [

    "Для расположения в форме поясняющей информации",
    "Для расположения в форме гиперссылок",
    "Для расположения в форме картинок с поясняющей информацией",
    "Варианты 1 и 2",
    "Варианты 1 и 2 и 3"
  ],

  "correct": 4
},
{
  "text": "Свойство диаграммы \"БазовоеЗначение\" содержит:",
  "options": [

    "Начальное значение координат.",
    "Максимальное значение текущей серии",
    "Шаг измерительной шкалы диаграммы"
  ],
  "correct": 0

},
{
  "text": "При размещении элементов в форме нельзя...",
  "options": [
    "разместить один и тот же элемент на двух страницах",

    "разместить два элемента формы, отображающие данные одного и того же реквизита формы",
    "разместить два элемента формы, отображающие данные одного и того же реквизита формы на одной странице",
    "разместить два элемента формы, отображающие данные одного реквизита формы на любых страницах одной и той же панели"
  ],
  "correct": 0

},
{
  "text": "Если для элемента управления \"Поле надписи\" в качестве источника данных указан реквизит справочника, то выводимая надписью информация будет определяться:",
  "options": [

    "свойством \"Заголовок\" элемента формы \"Поле надписи\"",
    "значением реквизита, указанного в свойстве \"Данные\" элемента формы \"Поле надписи\"",
    "свойством \"Заголовок\" элемента формы \"Поле надписи\", если значение реквизита справочника неопределенно",
    "Варианты 2 и 3"

  ],

  "correct": 1
},

{

  "text": "Сколько может быть создано форм, подчиненных (к примеру) объекту конфигурации справочник \"Номенклатура\"?",

  "options": [
    "Произвольное количество",
    "Форма элемента, форма группы (для иерархических справочников) и произвольное количество форм списка",

    "Три или пять в зависимости от настройки иерархии справочника"
  ],

  "correct": 0
},

{
  "text": "Элемент управления \"Поле HTML-документа\" управляемой формы предназначен:",

  "options": [
    "Для просмотра HTML-документов",

    "Для редактирования HTML-документов",
    "Для просмотра или редактирования HTML-документов"

  ],

  "correct": 0
},

{

  "text": "Редактировать HTML-документ, отображаемый в элементе управляемой формы \"Поле HTML-документа\", можно:",

  "options": [

    "в режиме конфигуратора",
    "в режиме 1С:Предприятие, средствами самого элемента формы",

    "в режиме 1С:Предприятие, с использованием других элементов формы",
    "Варианты 1 и 2",
    "Варианты 1 и 3",

    "Варианты 1 и 2 и 3"
  ],
  "correct": 4
},
{
  "text": "HTML-документ в элементе формы \"Поле HTML-документа\" может быть сформирован:",

  "options": [
    "Программно",

    "Загружен из ресурса, указываемого через URL",
    "Загружен из макета типа HTML-документ",
    "Верны ответы 1 или 2 или 3"
  ],
  "correct": 3
},
{
  "text": "Список значений, используемый в элементе управляемой формы \"Поле ввода\", может быть сформирован:",
  "options": [
    "Только программно",
    "Только в режиме конфигуратора в специальном окне, которое можно открыть в разделе \"Использование\" палитры свойств элемента формы",
    "Только в режиме 1С:Предприятие в специальном окне, которое можно открыть в разделе \"Использование\" палитры свойств элемента формы",
    "Программно и в режиме конфигуратора в специальном окне, которое можно открыть в разделе \"Использование\" палитры свойств элемента формы",
    "Для поля ввода список значений не задается"
  ],

  "correct": 3
},
{
  "text": "Можно ли, нажав на картинку, выполнить некоторые действия?",
  "options": [
    "Нет, нельзя",
    "Можно, для этого необходимо в окне свойств элемента формы \"Декорация\" установить флаг \"Гиперссылка\" и сформировать текст обработчика события \"Нажатие\"",
    "Можно, для этого необходимо сформировать текст обработчика события \"Нажатие\" элемента формы \"Декорация\". Устанавливать в окне свойств флаг \"Гиперссылка\" не нужно"
  ],
  "correct": 1
},
{
  "text": "Для выбора значений из списков можно использовать следующие элементы управляемой формы",

  "options": [
    "Поле ввода",
    "Поле выбора",
    "Поле списка",
    "Верны ответы 2 и 3",
    "Верны ответы 1 и 2 и 3"
  ],
  "correct": 0

},
{
  "text": "С помощью элемента управляемой формы \"Поле текстового документа\" можно отображать и редактировать:",
  "options": [
    "Обычный текст",
    "Текст, написанный на языке запросов (с подсветкой синтаксических конструкций)",
    "Текст, написанный на встроенном языке (с подсветкой синтаксических конструкций)",
    "HTML-документы (с подсветкой синтаксических конструкций)",
    "Верны ответы 1 и 2 и 3",
    "Верны все варианты"
  ],

  "correct": 0
},
{
  "text": "Элемент управления обычной формы \"Разделитель\" позволяет:",
  "options": [
    "Визуально разделять элементы управления, размещенные в форме",
    "Перераспределять внутреннее пространство формы, изменяя размеры расположенных в ней элементов управления, при изменении размеров самой формы",

    "Перераспределять внутреннее пространство формы, изменяя размеры расположенных в ней элементов управления, привязанных к разделителю. Размеры самой формы при этом не меняются",
    "Перераспределять внутреннее пространство формы, изменяя размеры расположенных в ней элементов управления, привязанных к разделителю, при изменении размеров самой формы"
  ],
  "correct": 2
},
{

  "text": "Визуально объединять элементы управления, размещенные в обычной форме, можно с помощью:",
  "options": [
    "Элемента управления \"Табличное поле\"",
    "Элемента управления \"Поле списка\"",
    "Элемента управления \"Рамка группы\""
  ],
  "correct": 2
},
{

  "text": "Поясняющая информация на элементе формы \"Кнопка командной панели\" может быть представлена в виде:",
  "options": [
    "Надписи",
    "Картинки",
    "Картинки и надписи",
    "Либо надписи, либо картинки",

    "Верны ответы 1 и 2 и 3"
  ],
  "correct": 4
},
{

  "text": "В качестве обработчика события \"Нажатие\" элемента управления обычной формы \"Кнопка\" может быть:",
  "options": [
    "Выбрано стандартное действие",
    "Выбрана процедура модуля формы, в которой расположена кнопка",
    "Выбрана глобальная процедура, описанная в общем модуле",

    "Верны ответы 1 и 2",
    "Верны ответы 1, 2 и 3"
  ],
  "correct": 3
},

{
  "text": "Можно ли при нажатии на элемент управляемой формы \"Кнопка командной панели\" осуществить вызов подменю?",
  "options": [
    "Нельзя, для реализации подобного функционала нужно использовать другой элемент формы",
    "Можно, для этого в качестве обработчика события \"Нажатие\" необходимо выбрать стандартное действие \"Меню\"",
    "Можно, если в качестве значения свойства \"Режим меню\" выбрать \"Использовать\" или \"Использовать дополнительно\""

  ],
  "correct": 0
},
{

  "text": "Сколько элементов формы \"Командная панель\" расположено на форме?",

  "options": [
    "0",
    "1",

    "2",
    "3",
    "4"
  ],
  "correct": 2

},
{
  "text": "Для управления информацией, расположенной в форме, группа формы с видом \"Командная панель\" может содержать:",

  "options": [
    "Группу кнопок",

    "Подменю",
    "Дополнение элемента формы",
    "Варианты 1 и 2",
    "Варианты 1 и 3",
    "Варианты 1 и 2 и 3"
  ],
  "correct": 5
},
{
  "text": "Каким образом для элемента формы группа с видом \"Командная панель\" реализовать возможность его автоматического заполнения?",

  "options": [
    "В окне свойств достаточно установить флаг \"Изменяет данные\"",
    "В окне свойств достаточно установить флаг \"Автозаполнение\"",
    "В окне свойств установить флаг \"Изменяет данные\" и, обязательно, выбрать значение свойства \"Источник команд\"",
    "В окне свойств установить флаг \"Автозаполнение\" и, обязательно, выбрать значение свойства \"Источник команд\"",
    "Выбрав значение в свойстве \"Источник команд\""
  ],
  "correct": 4
},
{

  "text": "В конфигурацию добавлен новый справочник \"Договора\", подчиненный справочнику \"Контрагенты\". Каким образом, в режиме Конфигуратора, необходимо модернизировать основную управляемую форму элемента справочника \"Контрагенты\", чтобы для конкретного контрагента имелась возможность просмотреть его договора? Каждая из форм имеет автоматически заполняемую командную панель.",
  "options": [
    "В командную панель каждой из форм необходимо вставить кнопку с выбранной стандартной командой по переходу к подчиненному справочнику",
    "Ничего делать не надо, в командную панель автоматически будет добавлена кнопка \"Перейти\", позволяющая открыть форму подчиненного справочника",
    "Ничего делать не надо, команда всегда автоматически появляется в интерфейсе, но не в командной панели, а в панели навигации формы",
    "Саму команду создавать не нужно, но можно управлять ее видимостью в панели навигации формы"
  ],

  "correct": 3
},
{
  "text": "Свойство \"Вспомогательная\" элемента управления \"Командная панель\" предназначено:",
  "options": [
    "Для расположения кнопок с командами, дополняющими команды основной панели формы",
    "Для исключения командной панели из порядка обхода элементов управления в форме",
    "Для расположения кнопок с командами, относящимися к элементам управления формы, а не к самой форме"
  ],
  "correct": 1
},
{
  "text": "Элемент формы \"Поле табличного документа\" предназначен для размещения в форме:",

  "options": [
    "Данных в виде динамических списков",
    "Табличного документа",
    "Табличной части",
    "Варианты 1 или 2",
    "Варианты 1 или 3",
    "Варианты 1 или 2 или 3"
  ],
  "correct": 1
},
{

  "text": "При определении реквизита управляемой формы, в качестве его типа можно указать:",
  "options": [
    "Дерево значений",
    "Таблицу значений",
    "Null",
    "Верны ответы 1 и 2",
    "Верны ответы 2 и 3",
    "Верны ответы 1 и 2 и 3"
  ],

  "correct": 5
},
{
  "text": "Для размещения в управляемой форме табличной части объекта используется элемент формы",
  "options": [
    "Табличный документ",
    "Таблица",

    "Поле",
    "Группа - список",
    "Варианты 1 или 2",
    "Варианты 1 или 2 или 3"
  ],
  "correct": 1

},
{
  "text": "Можно ли одновременно создать элемент управления \"Поле ввода\" (в обычной форме) вместе с поясняющей надписью, представляющей элемент управления \"Надпись\"?",
  "options": [
    "Нет, нельзя, так как это разные элементы управления",
    "Можно, для этого необходимо создавать поле ввода через пункт главного меню \"Форма-Вставить элемент управления.\"",
    "Можно, для этого необходимо создавать поле ввода, воспользовавшись одноименной кнопкой на панели инструментов \"Элементы управления\""
  ],

  "correct": 1
},
{
  "text": "Элемент формы \"Поле ввода\" предназначен для:",
  "options": [

    "Ввода значений непосредственно в поле, например, с клавиатуры",
    "Выбора ссылок на объекты",
    "Выбора значений из предварительно сформированного списка",
    "Верны ответы 1 и 2 и 3",
    "Верны ответы 1 и 2"
  ],
  "correct": 3

},

{
  "text": "Тонкая прерывистая линия красного цвета в поле ввода (например, предназначенное для ввода контрагента) означает:",
  "options": [
    "Данное поле недоступно для заполнения",

    "Данное поле обязательно к заполнению",
    "У данного поля создан обработчик события \"ПроверкаЗаполнения\"",
    "У данного поля определен один (или более) обработчик события"

  ],
  "correct": 1

},
{
  "text": "Если в качестве типа значения реквизита связанного с элементом формы \"Поле ввода\" выбрано \"СправочникСсылка.Номенклатура\", то можно ли организовать быстрый выбор значения этого поля, набирая наименование конкретной позиции номенклатуры непосредственно в самом поле ввода?",
  "options": [

    "Нет, нельзя",
    "Можно. Для этого необходимо выбрать свойство поля ввода \"Автовыбор незаполненного\"",
    "Можно. Для этого необходимо выбрать свойство поля ввода \"Быстрый выбор\"",
    "Можно. Для этого необходимо в окне редактирования справочника \"Номенклатура\" на закладке \"Поле ввода\" в поле \"Ввод по строке\" выбрать \"Наименование\""
  ],
  "correct": 3
},
{
  "text": "Состав кнопок, расположенных справа у элемента формы \"Поле ввода\", определяется:",
  "options": [

    "Значением свойства поля ввода \"Тип значения\"",
    "Заданием значений соответствующих свойств в свойствах элемента формы",
    "Типом формы",
    "Верны ответы 1 и 2",
    "Верны ответы 1 и 2 и 3"
  ],
  "correct": 3
},
{
  "text": "При ситуации, отображенной на картинке, если обратиться к \"Контрагент\" в модуле формы документа, то",
  "options": [

    "получим сообщение об ошибке из-за некорректной настройки формы",
    "получим значение реквизита формы",
    "получим значение реквизита документа",
    "получим объект, представляющий собой элемент формы"
  ],
  "correct": 1
},
{
  "text": "Какую кнопку необходимо отобразить у элемента формы \"Поле ввода\", чтобы для выбора значения можно было использовать выпадающий список?",
  "options": [

    "Кнопку выпадающего списка",
    "Кнопку выбора",
    "Кнопку регулирования",
    "Нет правильного ответа"
  ],
  "correct": 0

},
{
  "text": "Можно ли в один элемент формы \"Поле ввода\" вводить значения разных типов?",
  "options": [
    "Нельзя",
    "Можно, если он связан с реквизитом составного типа",

    "Можно, если он связан с реквизитом составного типа, и также отмечено свойство \"Выбирать тип\""
  ],
  "correct": 2
},
{
  "text": "Если в качестве типа значения реквизита, связанного с элементом формы \"Поле ввода\", выбрано \"СправочникСсылка.Номенклатура\", то можно ли организовать быстрый выбор значения этого поля, набирая значение реквизита конкретной позиции номенклатуры непосредственно в самом поле ввода?",

  "options": [
    "Нет, нельзя",
    "Можно. Для этого необходимо выбрать у соответствующего реквизита установить \"Автовыбор незаполненного\"",
    "Можно. Для этого необходимо отметить у соответствующего реквизита свойство \"Быстрый выбор\"",
    "Можно. Для этого необходимо в окне редактирования справочника \"Номенклатура\" на закладке \"Поле ввода\" в поле \"Ввод по строке\" указать соответствующий реквизит"
  ],

  "correct": 3
},
{
  "text": "Различается ли набор свойств у элемента управления \"Поле ввода\", созданного в форме и расположенного в таблице этой формы?",
  "options": [

    "Различается",
    "Не различается",
    "Различается, если только это не поля одного типа значений"
  ],
  "correct": 0
},

{

  "text": "В модуле объекта справочника \"Номенклатура\" объявлена процедура со словом \"Экспорт\". Может ли она быть вызвана \"напрямую\" из модулей подчиненных форм?",
  "options": [
    "Вызов возможен из модуля любой формы конфигурации",
    "Вызов возможен только из модулей основных форм данного справочника",
    "Вызов возможен только из формы, где основным реквизитом указан \"СправочникОбъект.Номенклатура\"",

    "Вызов возможен только из подчиненной формы справочника \"Номенклатура\""
  ],
  "correct": 2
},
{
  "text": "На рисунке представлена::<br><img src='dendro.png' alt='Дендрограмма' width='400'>",
  "options": [
    "Диаграмма",

    "Сводная диаграмма",

    "Дендрограмма",
    "Диаграмма Ганта"
  ],
  "correct": 2
},
{
  "text": "Свойство \"Вид\" элемента формы",
  "options": [
    "можно менять всегда и любым способом",
    "можно менять только программно",
    "нельзя изменить, если задана связь элемента формы с данными",
    "в принципе нельзя изменить"
  ],
  "correct": 0
},
{
  "text": "При обращении к обычной форме \"извне\" для чтения данных формы",

  "options": [
    "необходимо обращаться к элементам управления, отображающим данные",
    "необходимо обращаться к реквизитам формы и свойствам расширения формы",
    "необходимо передавать данные через экспортные переменные общих модулей",
    "Варианты 1 или 2 (в зависимости от типа элемента управления формы)",
    "Подойдет любой из указанных вариантов"
  ],
  "correct": 2
},
{
  "text": "На рисунке представлена::<br><img src='diagramma-ganta.png' alt='Ганта' width='400'>",

  "options": [
    "Диаграмма",
    "Сводная диаграмма",
    "Дендрограмма",
    "Диаграмма Ганта"
  ],
  "correct": 3
},
{
  "text": "Что произойдет, если выполнить команду, показанную на рисунке?",
  "options": [
    "Произойдет переход к процедуре (обработчику события), если таковой определен. В случае его отсутствия ничего не произойдет",
    "Произойдет переход к процедуре (обработчику событий), если таковой определен. В случае его отсутствия процедура будет создана",
    "Произойдет создание процедуры - обработчика события",
    "Откроется диалог по выбору варианта создания обработчика события"

  ],
  "correct": 1
},
{
  "text": "Для чего предназначены элементы формы?",
  "options": [
    "Для хранения данных",
    "Для обеспечения возможности интерактивного изменения данных",
    "Для обеспечения отображения данных",

    "Верны 1 и 3",
    "Верны 2 и 3",
    "Верны все варианты"
  ],
  "correct": 4
},
{
  "text": "Каким образом в основной управляемой форме объекта разместить список объектов другого типа (например в управляемой форме элемента справочника \"Контрагенты\" разместить список договоров?",

  "options": [
    "Данное действие можно реализовать только за счет создания табличной части у справочника \"Контрагенты\", которая будет содержать ссылки на договора",
    "Создать элемент формы \"Таблица\". Присвоить свойству этого поля \"Тип значения\" значение \"СправочникСписок.Договора\"",
    "Создать реквизит формы с типом \"СправочникСписок.Договора\", разместить в форме, элемент формы \"Таблица\", связанный с данным реквизитом",
    "Создать реквизит формы с типом \"Динамический список\", разместить в форме, элемент формы \"Таблица\", связанный с данным реквизитом"
  ],
  "correct": 3
},

{
  "text": "Что произойдет, если выполнить команду, показанную на рисунке?",
  "options": [
    "Произойдет переход к обработчику события \"При изменении\"",
    "В окне предварительного просмотра формы данных элемент формы станет активным",
    "Произойдет переход к реквизиту, свойству реквизита формы, с которым связан данный элемент формы",
    "Форма предварительного просмотра внешнего вида формы откроется в отдельном окне",
    "Откроется форма поиска по модулю формы с указанием строк, в которых используется обращение к данному элементу формы"
  ],
  "correct": 3
},

{
  "text": "Что произойдет, если выполнить команду, показанную на рисунке?",
  "options": [
    "Ничего не произойдет, так как для группы \"Страница\" это действие не может быть выполнено",
    "Создается новый элемент формы \"Группа-Страницы\", он будет располагаться выше текущего и в него переместится группа \"Страница\" для которой выполнялась команда.",
    "Создается новый элемент формы \"Группа-Страницы\", он будет располагаться выше текущего и в него скопируется группа \"Страница\" для которой выполнялась команда.",
    "Группа \"Страница\" \"Товары\" станет первой",

    "Ничего не произойдет, так как группа \"Страницы\" расположена под самой командной панелью (первый элемент в дереве)"
  ],
  "correct": 3
},
{
  "text": "В управляемой форме существуют следующие виды привязок:",
  "options": [
    "Ручная",
    "Автоматическая",

    "Полуавтоматическая",
    "Верны ответы 1 и 2",
    "Верны ответы 1, 2 и 3",
    "В управляемой форме нет привязок"
  ],
  "correct": 5
},
{

  "text": "Выполнение команды \"Проверить\" приводит",
  "options": [
    "к выполнению синтаксического контроля кода модуля формы",

    "к открытию разрабатываемой формы в отдельном окне (без возможности заполнения реквизитов, табличных частей формы)",
    "к открытию разрабатываемой формы в отдельном окне (с возможностью заполнения реквизитов, табличных частей формы)",
    "Варианты 1 и 2",
    "Варианты 1 и 3"
  ],
  "correct": 2

},
{
  "text": "Выполнение команды \"Показать ошибки размещения\" позволяет:",

  "options": [
    "отобразить любые элементы формы, с не заполненным свойством \"Путь к данным\"",
    "отобразить элементы формы, связанные с одним и тем же элементом данных (дубли)",
    "отобразить ошибки задания свойств элементов формы, которые будут приводить к проблемах при их размещении на форме (например ширины)",
    "Варианты 1 и 2",
    "Варианты 1 и 2 и 3"
  ],
  "correct": 2
},

{
  "text": "Область предварительного просмотра внешнего вида формы (в нижней части рисунка) позволяет просматривать результат:",
  "options": [
    "в разных масштабах",
    "в разных вариантах управляемого интерфейса (Такси/Версия 8.2)",
    "для разных клиентов (персональный компьютер/ мобильный клиент)",
    "Варианты 1 и 2",
    "Варианты 1 и 2 и 3"
  ],
  "correct": 4

},
{
  "text": "Свойство элемента формы \"Пользовательская видимость\" позволяет",
  "options": [
    "исключить реквизит из данных формы (реквизит не передается с сервера) для конкретного пользователя системы. Изменить эту настройку пользователь не может.",
    "исключить реквизит из данных формы (реквизит не передается с сервера) для роли пользователя. Изменить эту настройку пользователь не может.",

    "определить видимость элемента формы по умолчанию. При этом пользователь может самостоятельно изменить это свойство в редакторе настройки формы",
    "делает связанный с реквизитом элемент формы доступным только для просмотра"
  ],
  "correct": 2
},
{
  "text": "Кнопки управляющие режимом просмотра в области предварительного просмотра редактора формы позволяют выбрать режимы:",
  "options": [

    "Персональный компьютер (Такси), отображение Обычное, масштаб 110%",
    "Персональный компьютер (Интерфейс 8.2), отображение Обычное, разрешение монитора из списка",
    "Мобильное устройство (мобильный клиент), модель телефона из списка, масштаб 110%",
    "Вариант 1 или 2",
    "Вариант 1 или 3",

    "Возможен любой из указанных вариантов"
  ],
  "correct": 4
},
{
  "text": "Свойство \"Использовать всегда\"",
  "options": [

    "не дает пользователю убирать видимость элементов формы, связанных с данным реквизитом",
    "позволяет пользователю управлять видимостью связанных элементов формы, но данный реквизит всегда будет доступен на стороне клиента в случае наличия связанного с ним элемента формы",
    "вне зависимости, от того связан ли реквизит формы с элементом формы, определяет его доступность на стороне клиента"

  ],
  "correct": 2
},
{
  "text": "Управлять значением свойства реквизита \"Использовать всегда\" можно для типов:",

  "options": [
    "число, строка, дата, булево",
    "ссылочных типов",
    "хранилище значения",

    "Варианты 1 и 2",

    "Варианты 1 и 2 и 3"
  ],
  "correct": 3

},
{
  "text": "В редакторе формы управлять расположением элемента формы (относительно других) можно",
  "options": [
    "в дереве элементов формы, используя команды \"Переместить вверх\", \"Переместить вниз\"",
    "в списке реквизитов формы, используя команды \"Переместить вверх\", \"Переместить вниз\"",
    "перетаскиванием мышью в окне предварительного просмотра",

    "Вариант 1 или 2",
    "Вариант 1 или 3",
    "Вариант 1 или 2 или 3"
  ],
  "correct": 4
},
{
  "text": "При создании реквизита формы типа \"ДинамическийСписок\" способ формирования запроса к данным определяется разработчиком:",
  "options": [
    "заданием основной таблицы",
    "ручным формированием запроса",

    "определяется автоматически исходя из принадлежности формы определенному объекту конфигурации",
    "Верны варианты 1 или 2"
  ],
  "correct": 3
},
{

  "text": "Ключ динамического списка определяется:",
  "options": [
    "автоматически в случае указания основной таблицы",
    "с использованием специализированных свойств динамического списка, в случае если основная таблица не выбрана",
    "с использованием специализированных свойств динамического списка в любом случае (выбрана основная таблица или нет)",
    "Верны варианты 1 или 2"
  ],

  "correct": 3
},
{
  "text": "При настройке ключа динамического списка в случае указания в свойстве \"Вид ключа\" значения \"Авто\" в качестве значения свойства \"Поле ключа\" может использоваться:",
  "options": [
    "номер строки",
    "поле динамического списка",

    "ключ динамического списка (может включать несколько полей, но только ссылочных типов)",
    "Верны варианты 1 или 2",
    "Верны варианты 2 или 3",
    "Верны все варианты"
  ],

  "correct": 3
},
{
  "text": "При настройке ключа динамического списка в случае указания в свойстве \"Вид ключа\" значения \"Авто\" в качестве значения свойства \"Поле ключа\" может использоваться:",

  "options": [
    "номер строки",
    "ключ динамического списка (может включать несколько полей, но только ссылочных типов)",
    "ключ динамического списка (может включать несколько полей, не обязательно только ссылочных типов)",
    "Верны варианты 1 или 2",
    "Верны варианты 1 или 3"

  ],
  "correct": 4
},
{
  "text": "Свойство динамического списка \"Динамическое считывание данных\" применимо для:",

  "options": [
    "объектных таблиц системы",
    "основных таблиц регистров",
    "виртуальных таблиц регистров накопления",
    "Верны варианты 1 и 2",

    "Верны варианты 1 и 3",

    "Верны все варианты"
  ],

  "correct": 3
},
{
  "text": "Свойство динамического списка \"Динамическое считывание данных\" применимо для:",
  "options": [
    "таблиц критериев отбора",
    "таблиц задач по исполнителю",

    "виртуальной таблицы \"ДвиженияССубконто\"",
    "Верны варианты 1 и 2",

    "Верны варианты 1 и 3",
    "Верны все варианты"
  ],
  "correct": 2
},
{
  "text": "Ключ динамического списка (в случае если в качестве основной таблицы указана одна из следующих таблиц: план обмена, справочник, список документов, журнал документов, план видов характеристик, план счетов, план видов расчета, бизнес-процесс, задача, таблица точек бизнес-процесса) представляет собой:",

  "options": [
    "внутренний идентификатор объекта",
    "ссылку",
    "ключ записи",
    "число",
    "Нет правильного ответа"
  ],

  "correct": 1
},
{
  "text": "Ключ динамического списка (в случае если в качестве основной таблицы указана таблица критерия отбора или таблица задач по исполнителю) представляет собой:",
  "options": [

    "внутренний идентификатор объекта",
    "ссылку",
    "ключ записи",
    "число",
    "Нет правильного ответа"
  ],

  "correct": 1
},
{
  "text": "Ключ динамического списка (в случае если в качестве основной таблицы указана виртуальная таблица регистра сведений \"СрезПервых\" или \"СрезПоследних\") представляет собой:",

  "options": [
    "внутренний идентификатор объекта",

    "ссылку",
    "ключ записи",
    "число",
    "Нет правильного ответа"

  ],
  "correct": 2
},

{
  "text": "Ключ динамического списка (в случае если в качестве основной таблицы указана одна из следующих таблиц: основная таблица регистра сведений, регистра накопления, регистра бухгалтерии, регистра расчета, виртуальная таблица регистра бухгалтерии \"ДвиженияССубконто\") представляет собой:",

  "options": [
    "внутренний идентификатор объекта",

    "ссылку",
    "ключ записи",
    "число",

    "Нет правильного ответа"

  ],
  "correct": 2
},
{

  "text": "Ключ динамического списка (в случае если в качестве основной таблицы указана одна из виртуальных таблицы регистров накопления, бухгалтерии, расчета, кроме таблицы \"ДвиженияССубконто\") представляет собой:",
  "options": [
    "внутренний идентификатор объекта",

    "ссылку",

    "ключ записи",
    "число",
    "Нет правильного ответа"
  ],
  "correct": 3
},

{
  "text": "Выполнение навигационной команды \"Открыть\" свойства динамического списка \"Настройка списка\" (представленной на рисунке) открывает форму в которой можно:",
  "options": [
    "управлять отбором, порядок отображения данных",
    "настраивать группировку, условное оформление данных",
    "определять текст запроса",
    "Варианты 1 и 2",

    "Верны все варианты"
  ],
  "correct": 3
},
{

  "text": "Выполнение навигационной команды \"Открыть\" свойства динамического списка \"Настройка списка\" (представленной на рисунке) открывает форму в которой можно:",
  "options": [
    "управлять отбором, порядок отображения данных",
    "настраивать группировку, условное оформление данных",
    "определять текст запроса",
    "Варианты 1 и 2",

    "Верны все варианты"
  ],
  "correct": 4
},
{

  "text": "Изменить порядок обхода элементов обычной формы",
  "options": [
    "Нельзя, если установлено свойство формы \"Автопорядок обхода\"",
    "Можно, непосредственно в форме (после выполнения определенной команды)",
    "Можно, в свойствах элемента управления формы",
    "Верны ответы 2 и 3",
    "Верны ответы 1, 2 и 3"

  ],
  "correct": 4
},
{

  "text": "Полнотекстовый поиск в динамическом списке управляемой формы выполняется:",
  "options": [
    "по данным текущей колонки динамического списка",
    "по данным всех полей, отображаемых в динамическом списке",

    "по данным всех полей динамического списка",
    "Варианты 1 или 2 или 3 в зависимости от настройки динамического списка",
    "Такая возможность в динамическом списке отсутствует"
  ],

  "correct": 1
},
{
  "text": "Для отображения дополнительных данных в динамическом списке (например остатки взаиморасчетов в списке партнеров) необходимо использовать обработчик события:",

  "options": [

    "При создании на сервере",
    "При открытии",
    "При получении данных на сервере",

    "Вариант 1 и 3",
    "Вариант 1 или 3",
    "Вариант 1 или 2 или 3"

  ],
  "correct": 2
},
{

  "text": "Для предоставления пользователю возможности выполнять редактирование текстов с оформлением необходимо использовать объект:",
  "options": [
    "Текстовый документ",

    "Форматированный документ",
    "Табличный документ",
    "Варианты 1 или 2",
    "Варианты 1 или 3",
    "Верны все варианты"
  ],
  "correct": 2
},

{
  "text": "Для того чтобы предоставить пользователю возможность интерактивного изменения хранимого документа с помощью объекта \"Форматированный документ\", следует выполнить следующие шаги:",
  "options": [
    "Создать реквизит формы типа \"ФорматированныйДокумент\" и установить для него свойство \"Сохраняемые данные\"",
    "Реквизит формы типа \"ФорматированныйДокумент\" сделать основным реквизитом формы",
    "Создать элемент формы типа \"Поле ввода\" вида \"Поле форматированного документа\"",
    "Варианты 1 и 2",
    "Варианты 1 и 3",

    "Варианты 1 и 2 и 3"
  ],
  "correct": 4
},
{
  "text": "Закладки на форме могут быть расположены:",
  "options": [
    "Сверху или снизу",

    "Слева (горизонтально) или справа (горизонтально)",
    "Пролистывание (сенсорный экран)",
    "Варианты 1 и 2",
    "Варианты 1 и 3",
    "Верны все варианты"

  ],
  "correct": 5
},
{
  "text": "Добавить страницу в форму можно:",

  "options": [
    "используя команду \"Добавить\" командной панели дерева элементов формы, с последующим выбором \"Группа-Страница\"",
    "используя пункт контекстного меню формы \"Добавить\" для любого элемента формы, с последующим выбором \"Группа-Страница\"",
    "Программным способом",

    "Варианты 1 и 2",
    "Варианты 1 и 3",
    "Верны все варианты"
  ],

  "correct": 4
},
{

  "text": "Какой из реквизитов формы, представленной на рисунке, является основным?",
  "options": [
    "Объект",
    "Документ",

    "Справочник",
    "Объект и Справочник",
    "У данной формы нет основного реквизита"

  ],

  "correct": 2
},
{
  "text": "Добавить элемент управления в обычную форму можно:",

  "options": [
    "Через пункт главного меню \"Форма-Вставить элемент управления\"",
    "Выбрав необходимый пункт контекстного меню на панели формы",
    "С помощью командной панели \"Элементы управления\"",

    "Верны ответы 1 и 3",
    "Верны все варианты"
  ],
  "correct": 3

},
{
  "text": "Какой из реквизитов формы, представленной на рисунке, является основным?",
  "options": [
    "Объект",
    "Документ",
    "Справочник",

    "Объект и справочник",
    "У данной формы нет основного реквизита"
  ],
  "correct": 4
},
{
  "text": "Для того, чтобы у в форме появились команды форматирования документа необходимо:",

  "options": [
    "Воспользоваться свойством \"Отображение командной панели\"",
    "Добавить командную панель и указать в качестве источника команд форматированный документ",
    "Ничего делать не нужно, команды появляются автоматически",
    "Варианты 1 или 3"
  ],

  "correct": 1
},
{
  text: "Можно ли получить список всех точек останова, выставленных в модулях конфигурации?",
    options: [
      "Нет, но можно последовательно обойти все точки останова в открытом модуле",

      "По всем — нет, но можно получить посредством специального пункта меню \"Отладка\" список всех точек останова текущего модуля",
      "Да, посредством специального пункта меню \"Отладка\"",
      "Да, программно, посредством использования специального объекта системы"
    ],
      correct: 2
  }
];

// ========== ФУНКЦИЯ ПОИСКА ОТВЕТОВ ==========
(function() {
    if (typeof myQuestions === 'undefined' || !Array.isArray(myQuestions) || myQuestions.length === 0) {
        console.error('Массив myQuestions не загружен. Убедитесь, что вы скопировали его полностью.');
        return;
    }

    window.ga = function(query) {
        const q = myQuestions;
        if (typeof query === 'number') {
            const index = query - 1;
            if (index >= 0 && index < q.length) {
                console.log(`\n Вопрос ${query}: ${q[index].text}`);
                console.log(`Правильный ответ: ${q[index].options[q[index].correct]}`);
            } else {
                console.log(`Вопрос с номером ${query} не найден. Всего вопросов: ${q.length}`);
            }
        } 
        else if (typeof query === 'string') {
            const lowerQuery = query.toLowerCase();
            const found = q.filter((item, idx) => item.text.toLowerCase().includes(lowerQuery));
            if (found.length === 0) {
                console.log('Ничего не найдено.');
            } else {
                console.log(`Найдено вопросов: ${found.length}`);
                found.forEach(item => {
                    const originalIndex = q.indexOf(item) + 1;
                    console.log(`\n Вопрос ${originalIndex}: ${item.text}`);
                    console.log(`Правильный ответ: ${item.options[item.correct]}`);
                });
            }
        } 
        else {
            console.log('Использование: ga(номер) или ga("текст для поиска")');
        }
    };

    console.log('ga загружена. Примеры:\n  ga(1) — показать ответ на первый вопрос\n  ga("документ") — найти вопросы со словом "документ"');
})();